{
  "basic_info": {
    "id": "bernard_arnault_&_family",
    "name": "Bernard Arnault & family",
    "net_worth": "$211 billion",
    "source": "74",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Bernard_Arnault",
    "summary": "Bernard Jean Étienne Arnault (French: [bɛʁnaʁ ʒɑ̃ etjɛn aʁno]; born 5 March 1949) is a French businessman, investor and art collector. He is the founder, chairman and CEO of LVMH, the world's largest luxury goods company. Arnault is one of the richest individuals in the world; as of February 2025, he has an estimated net worth of US$186.8 billion according to Forbes and US$192 billion according to the Bloomberg Billionaires Index. \nBorn in Roubaix, Arnault was raised in a devoutly Catholic household. He pursued Engineering at École polytechnique, graduating in 1971. He began his career in his father's company, Ferret-Savinel, shifting its focus to real estate, which laid the groundwork for his future career in the luxury goods market.\nArnault's entry into the luxury sector was marked by his strategic acquisition in 1984 of the financially-struggling textile and retail conglomerate Boussac Saint-Frères, which included the prestigious fashion house Christian Dior. His aggressive business strategies earned him the nickname \"The Terminator\", as he revitalized Dior and sold off other assets for profit. In 1987, he played a key role in the creation of LVMH (an acronym for Louis Vuitton Moët Hennessy), a global luxury goods company, by merging Louis Vuitton with Moët Hennessy. Through a series of strategic acquisitions and investments, Arnault built LVMH into a leading company in the luxury industry, overseeing significant growth and expansion into various sectors, including fashion, jewelry, watches, and wine.\nArnault's influence extends beyond LVMH, with investments in web companies and philanthropic endeavors, particularly in the arts. He has been involved in notable real estate and yacht ventures. His leadership has led to LVMH becoming the largest company by market capitalization in the eurozone. Despite controversies, including his attempt to become a Belgian citizen, Arnault's business acumen has solidified his status as a key figure in the global luxury market."
  },
  "biography": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "business_philosophy": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "expertise_areas": [],
  "innovation_contributions": [],
  "leadership_style": {},
  "risk_management": {},
  "quotes": [
    {
      "text": "they have these two aspects, which may be contradictory: They are timeless, [and] they are at the utmost level of modernity.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "I repeatedly said that I would stay as a resident in France and that I would continue to pay my taxes... Today, I decided to remove any ambiguity. I withdraw my request for Belgian nationality. Requesting Belgian nationality was to better protect the foundation that I created with the sole purpose of ensuring the continuity and integrity of the LVMH group if I were to die.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "the 75% tax would not raise a lot of revenue but should prove less divisive, as now it was set to be levied on firms rather than people, and only due to stay in place for two years.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": " ===\n\nOn 12 February 1947, Christian Dior launched his first fashion collection for Spring–Summer 1947. The show of ",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": " was presented in the salons of the company's headquarters at 30 Avenue Montaigne. Originally, the two lines were named ",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": ". However, the new collection went down in fashion history as the ",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": " after the editor-in-chief of Harper's Bazaar Carmel Snow exclaimed, ",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": " The New Look was a revolutionary era for women at the end of the 1940s. When the collection was presented, the editor-in-chief also showed appreciation by saying; ",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": " The debut collection of Christian Dior is credited with having revived the fashion industry of France. Along with that, the New Look brought back the spirit of haute couture in France as it was considered glamorous and young-looking. ",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "\nThe silhouette was characterized by a small, nipped-in waist and a full skirt falling below mid-calf length, which emphasized the bust and hips, as epitomized by the ",
      "source": "Wikipedia",
      "context": "From biographical content"
    }
  ],
  "related_articles": [
    {
      "title": "Roubaix",
      "url": "https://en.wikipedia.org/wiki/Roubaix",
      "summary": "Roubaix (US:  roo-BAY, French: [ʁubɛ] or [ʁube] ; Dutch: Robaais; West Flemish: Roboais; Picard: Roubés) is a city in northern France, located in the Lille metropolitan area on the Belgian border. It is a historically mono-industrial commune in the Nord department, which grew rapidly in the 19th century from its textile industries, with most of the same characteristic features as those of English and American boom towns. This former new town has faced many challenges linked to deindustrialisation such as urban decay, with their related economic and social implications, since its major industries fell into decline by the middle of the 1970s. Located to the northeast of Lille, adjacent to Tourcoing, Roubaix is the chef-lieu of two cantons and the third largest city in the French region of Hauts-de-France ranked by population with nearly 99,000 inhabitants.\nTogether with the nearby cities of Lille, Tourcoing, Villeneuve-d'Ascq and eighty-six other communes, Roubaix gives structure to a four-centred metropolitan area inhabited by more than 1.1 million people: the European Metropolis of Lille. To a greater extent, Roubaix is in the center of a vast conurbation formed with the Belgian cities of Mouscron, Kortrijk and Tournai, which gave birth to the first European Grouping of Territorial Cooperation in January 2008, Lille–Kortrijk–Tournai with an aggregate population of over 2 million inhabitants.\n\n",
      "content": "Roubaix (US:  roo-BAY, French: [ʁubɛ] or [ʁube] ; Dutch: Robaais; West Flemish: Roboais; Picard: Roubés) is a city in northern France, located in the Lille metropolitan area on the Belgian border. It is a historically mono-industrial commune in the Nord department, which grew rapidly in the 19th century from its textile industries, with most of the same characteristic features as those of English and American boom towns. This former new town has faced many challenges linked to deindustrialisation such as urban decay, with their related economic and social implications, since its major industries fell into decline by the middle of the 1970s. Located to the northeast of Lille, adjacent to Tourcoing, Roubaix is the chef-lieu of two cantons and the third largest city in the French region of Hauts-de-France ranked by population with nearly 99,000 inhabitants.\nTogether with the nearby cities of Lille, Tourcoing, Villeneuve-d'Ascq and eighty-six other communes, Roubaix gives structure to a four-centred metropolitan area inhabited by more than 1.1 million people: the European Metropolis of Lille. To a greater extent, Roubaix is in the center of a vast conurbation formed with the Belgian cities of Mouscron, Kortrijk and Tournai, which gave birth to the first European Grouping of Territorial Cooperation in January 2008, Lille–Kortrijk–Tournai with an aggregate population of over 2 million inhabitants.\n\n\n== Geography ==\n\n\n=== Location ===\nRoubaix occupies a central position on the north-east slope of the Métropole Européenne de Lille: it is set on the eastern side of Lille and the southern side of Tourcoing, close to the Belgian border. As regards towns' boundaries, Roubaix is encompassed by seven cities which constitute its immediate neighbouring environment. These municipalities are namely: Tourcoing to the north and the northwest, Wattrelos to the northeast, Leers to the east, Lys-lez-Lannoy to the southeast, Hem to the south and Croix to the southwest and the west. Roubaix, alongside those municipalities and twenty-one other communes, belongs to the land of Ferrain, a little district of the former Castellany of Lille between the Lys and Scheldt rivers.\nAs the crow flies, the distance between Roubaix and the following cities is some odd: 16 kilometres (9.9 mi) to Tournai, 18 kilometres (11 mi) to Kortrijk, 84 kilometres (52 mi) to Brussels and 213 kilometres (132 mi) to Paris.\n\n\n=== Geology ===\nThe land upon which Roubaix stands belongs to the plain of Flanders. The Roubaisian area stretches on an east-west oriented shallow syncline axis which trends south-southeast to the Paleozoic limestone of the Mélantois-Tournaisis faulted anticline. It consists predominantly of Holocene alluvial sediment depositions. It is flat and low, with an elevation drop of only 35 m (114 ft 10 in) over its 13.23 square kilometres (5.11 sq mi). The lowest altitude of this area stands at 17 m (55 ft 9+1⁄2 in), while its highest altitude is 52 m (170 ft 7 in) meters above the sea level.\n\n\n=== Hydrology ===\nThe Trichon stream fed by waters of the Espierre stream used to flow through the rural landscape of Roubaix before the industrialisation process began to alter this area in the middle of the 19th century. From that century on, the ensuing industries, with their increasing needs for reliable supplies of goods and water, led to the building of an inland waterway connected upstream from the Deûle and downstream to the Marque and Espierre toward the Scheldt, which linked directly Roubaix to Lille.\nOpened in 1877, the Canal de Roubaix crosses the town from its northern neighbourhoods to its eastern neighbourhoods and partially flows along the city's boundaries. The Canal de Roubaix closed in 1985, after more than a century in use. Thank to the European funded project Blue Links, the waterway has been reopened to boating traffic since 2011.\n\n\n=== Climate ===\nThe area of the city is not known for undergoing unusual weather events. In regard to the town's geographi"
    },
    {
      "title": "LVMH",
      "url": "https://en.wikipedia.org/wiki/LVMH",
      "summary": "LVMH Moët Hennessy Louis Vuitton SE (French: [mɔɛt‿ɛnɛsi lwi vɥitɔ̃]), commonly known as LVMH, is a French multinational holding company and conglomerate that specializes in luxury goods and has its headquarters in Paris, France. The company was formed in 1987 through the merger of fashion house Louis Vuitton (founded in 1854) with Moët Hennessy, which had been established by the 1971 merger between the champagne producer Moët & Chandon (founded in 1743) and the cognac producer Hennessy (founded in 1765). In April 2023, LVMH became the first European company to surpass a valuation of $500 billion. In 2023, the company was ranked 47th in the Forbes Global 2000.\nLVMH controls around 60 subsidiaries that manage 75 luxury brands. In addition to Louis Vuitton and Moët Hennessy, LVMH's portfolio includes Christian Dior Couture, Givenchy, Fendi, Celine, Kenzo, Tiffany, Bulgari, Loewe, TAG Heuer, Marc Jacobs, Stella McCartney, Sephora and Loro Piana. The subsidiaries are often managed independently, under the umbrellas of six branches: Fashion Group, Wines and Spirits, Perfumes and Cosmetics, Watches and Jewelry, Selective Distribution, and Other Activities. LVMH owns Les Echos-Le Parisien Group, its media subsidiary. The wine estate of Château d'Yquem, whose origins date back to 1593, is under LVMH ownership. Bernard Arnault is the chairman, CEO and largest shareholder of LVMH, making him one of the richest people in the world as of 2024.\n\n",
      "content": "LVMH Moët Hennessy Louis Vuitton SE (French: [mɔɛt‿ɛnɛsi lwi vɥitɔ̃]), commonly known as LVMH, is a French multinational holding company and conglomerate that specializes in luxury goods and has its headquarters in Paris, France. The company was formed in 1987 through the merger of fashion house Louis Vuitton (founded in 1854) with Moët Hennessy, which had been established by the 1971 merger between the champagne producer Moët & Chandon (founded in 1743) and the cognac producer Hennessy (founded in 1765). In April 2023, LVMH became the first European company to surpass a valuation of $500 billion. In 2023, the company was ranked 47th in the Forbes Global 2000.\nLVMH controls around 60 subsidiaries that manage 75 luxury brands. In addition to Louis Vuitton and Moët Hennessy, LVMH's portfolio includes Christian Dior Couture, Givenchy, Fendi, Celine, Kenzo, Tiffany, Bulgari, Loewe, TAG Heuer, Marc Jacobs, Stella McCartney, Sephora and Loro Piana. The subsidiaries are often managed independently, under the umbrellas of six branches: Fashion Group, Wines and Spirits, Perfumes and Cosmetics, Watches and Jewelry, Selective Distribution, and Other Activities. LVMH owns Les Echos-Le Parisien Group, its media subsidiary. The wine estate of Château d'Yquem, whose origins date back to 1593, is under LVMH ownership. Bernard Arnault is the chairman, CEO and largest shareholder of LVMH, making him one of the richest people in the world as of 2024.\n\n\n== History ==\nIn 1987, Moët Hennessy and Louis Vuitton merged to create LVMH. As a result of different visions for the future of the merged entity, Alain Chevalier and Henry Racamier, the respective leaders of the predecessor firms, started to fight. Racamier invited Bernard Arnault to invest in LVMH. Rapidly, Arnault succeeded in taking control of LVMH at the expense of the initial family owners. Contrary to what is often indicated, Arnault did not establish LVMH.\nThe successful integration of various famous aspirational brands into a single group inspired other luxury companies to do the same. Thus, the French conglomerate Kering and the Swiss-based Richemont have also created extended portfolios of luxury brands. LVMH is a component of the Euro Stoxx 50 stock market index.\nMake Up For Ever was established in 1984, and it was acquired by LVMH in 1999.\nOn 7 March 2011, LVMH announced the acquisition of the 50.4% family-owned shares of the Italian jeweller Bulgari and the intention to make a tender offer for the rest, which was publicly owned. The transaction was about $5.2 billion.\nBy 2012, LVMH established LCapitalAsia, a continuation of its private-equity arm, focused on Asia. In early 2013, LVMH announced its co-investment of its private equity arm LCapitalAsia and the Chinese apparel company Xin Hee Co., Ltd.   \nIn February 2014, LVMH entered into a joint venture with the Italian fashion brand Marco De Vincenzo, taking a minority 45% stake in the firm.\nIn 2016, L Catterton Asia and Crescent Point, two private equity firms backed by LVMH, bought a majority stake in GXG.\nIn April 2017, LVMH announced it would gain ownership of Christian Dior haute couture, leather, men's and women's ready-to-wear, and footwear lines to integrate the entire Dior brand within its luxury group.\nIn January 2018, LVMH announced record sales of 42.6 billion euros in 2017, up 13% over the previous year, as all divisions turned in strong performances. In the same year, the net profit increased by 29%. On 1 November 2018, co-founder Alain Chevalier died at age 87.\n\nOn 12 May 2019, the fashion house Fenty, styled as FEИTY, created by singer Rihanna, was launched by LVMH in Paris. It is the first new fashion house by LVMH in 32 years, and she is the first woman of colour to head a brand under LVMH. On 15 July 2019, LVMH announced a new partnership to further develop the Stella McCartney House. On 29 November 2019, LVMH announced its 55% stake in Château d'Esclans, the producer best known for the brand Whispering Angel. Th"
    },
    {
      "title": "Dior",
      "url": "https://en.wikipedia.org/wiki/Dior",
      "summary": "Christian Dior SE (French: [kʁistjɑ̃ djɔʁ]), commonly known as Dior, is a French multinational luxury goods company that is controlled and chaired by French businessman Bernard Arnault, who also heads LVMH. As of December 2023, Dior controlled around 42% of the shares and 57% of the voting rights of LVMH. In addition, the Arnault family held a further 7% of the shares and 8% of the voting rights of LVMH as of that date.\nThe original fashion house was founded by French designer Christian Dior in 1946 to make haute couture items. Clothing is now produced by Christian Dior Couture, which is a subsidiary of LVMH, whereas Christian Dior SE is a holding company that controls LVMH. Bernard Arnault's daughter, Delphine Arnault, has been the CEO of Christian Dior Couture since February 2023. Bernard Arnault's eldest son, Antoine Arnault, is the CEO of Christian Dior SE.\n\n",
      "content": "Christian Dior SE (French: [kʁistjɑ̃ djɔʁ]), commonly known as Dior, is a French multinational luxury goods company that is controlled and chaired by French businessman Bernard Arnault, who also heads LVMH. As of December 2023, Dior controlled around 42% of the shares and 57% of the voting rights of LVMH. In addition, the Arnault family held a further 7% of the shares and 8% of the voting rights of LVMH as of that date.\nThe original fashion house was founded by French designer Christian Dior in 1946 to make haute couture items. Clothing is now produced by Christian Dior Couture, which is a subsidiary of LVMH, whereas Christian Dior SE is a holding company that controls LVMH. Bernard Arnault's daughter, Delphine Arnault, has been the CEO of Christian Dior Couture since February 2023. Bernard Arnault's eldest son, Antoine Arnault, is the CEO of Christian Dior SE.\n\n\n== History ==\n\n\n=== Founding ===\nThe House of Dior was established on 16 December 1946 at 30 Avenue Montaigne in Paris. However, the current Dior company celebrates 1947 as the opening year. Dior was financially backed by Marcel Boussac, a wealthy businessman. Boussac had originally invited Dior to design for Philippe et Gaston, but Dior refused, wishing to make a fresh start under his own name rather than reviving an old brand. The new couture house became part of \"a vertically integrated textile business\" already operated by Boussac. Its capital was at FFr 6 million and workforce at 80 employees. Although the company was largely a vanity project for Boussac, it was a majority-owned affiliate of Boussac Saint-Frères S.A. Nevertheless, Dior was allowed a then-unusual great part in his namesake label (legal leadership, a non-controlling stake in the firm, and one-third of pretax profits) despite Boussac's reputation as a \"control freak\". Dior's creativity also negotiated him a good salary.\"\n\n\n=== \"New Look\" ===\n\nOn 12 February 1947, Christian Dior launched his first fashion collection for Spring–Summer 1947. The show of \"90 models of his first collection on six mannequins\" was presented in the salons of the company's headquarters at 30 Avenue Montaigne. Originally, the two lines were named \"Corolle\" and \"Huit\". However, the new collection went down in fashion history as the \"New Look\" after the editor-in-chief of Harper's Bazaar Carmel Snow exclaimed, \"It's such a new look!\" The New Look was a revolutionary era for women at the end of the 1940s. When the collection was presented, the editor-in-chief also showed appreciation by saying; \"It's quite a revolution, dear Christian!\" The debut collection of Christian Dior is credited with having revived the fashion industry of France. Along with that, the New Look brought back the spirit of haute couture in France as it was considered glamorous and young-looking. \"We were witness to a revolution in fashion and to a revolution in showing fashion as well.\"\nThe silhouette was characterized by a small, nipped-in waist and a full skirt falling below mid-calf length, which emphasized the bust and hips, as epitomized by the \"Bar\" suit from the first collection. The Bar suit was a contribution from the head of Dior's tailoring atelier, a young Pierre Cardin, who was employed by the house from 1947 to 1949. The collection overall showcased more stereotypically feminine designs in contrast to the popular fashions of wartime, with full skirts, tight waists, and soft shoulders. Dior retained some of the masculine aspects, as they continued to hold popularity through the early 1940s, but he also wanted to include more feminine style.\nThe \"New Look\" became extremely popular, its full-skirted silhouette influencing other fashion designers well into the 1950s, and Dior gained a number of prominent clients from Hollywood, the United States, and the European aristocracy. As a result, Paris, which had fallen from its position as the capital of the fashion world after World War II, regained its preeminence. The New Look was welcomed in western E"
    },
    {
      "title": "Delphine Arnault",
      "url": "https://en.wikipedia.org/wiki/Delphine_Arnault",
      "summary": "Delphine Caroline Marie Arnault (French: [dɛlfin aʁno]; born 4 April 1975) is a French businesswoman who has been serving as the chairperson and chief executive officer of Christian Dior Couture since February 2023. \nArnault is the daughter of Bernard Arnault. She is a director of LVMH and has been Executive Vice President of Louis Vuitton since 2013.\n\n",
      "content": "Delphine Caroline Marie Arnault (French: [dɛlfin aʁno]; born 4 April 1975) is a French businesswoman who has been serving as the chairperson and chief executive officer of Christian Dior Couture since February 2023. \nArnault is the daughter of Bernard Arnault. She is a director of LVMH and has been Executive Vice President of Louis Vuitton since 2013.\n\n\n== Early life ==\nShe is the elder child of Bernard Arnault from his first wife, Anne Dewavrin. She has a younger brother, Antoine Arnault, as well as three half-brothers from her father's second marriage, including Frédéric Arnault.\nBetween the ages of seven and ten, Arnault and her family lived in New Rochelle, New York, where she and her brother attended a French-American school. She later earned degrees from the London School of Economics and EDHEC Business School (Ecole des Hautes Etudes Commerciales du Nord).\nIn 1994, she was presented as a debutante at Le Bal des débutantes in Paris.\n\n\n== Career ==\nArnault began her career working at McKinsey & Company for two years. She joined LVMH in 2000, initially working with Dior creative director John Galliano's own label.\nSince 2003, Arnault has been a member of the management board of the LVMH group, the first woman and youngest person to occupy that post. She is also a member of the board of directors for Moët Hennessy and M6, as well as a managing partner of a wealth management company.\nIn 2008, Arnault was named deputy chief of the designer Christian Dior Couture, which she quit in 2013 to join Louis Vuitton as a director and executive vice president.\nIn May 2014, Arnault started the LVMH Prize, an international competition for young fashion designers. The objective of the LVMH group is to discover the talents and creativity of new designers – \"It is necessary to recognize the talent and creativity, as well as the ways in which we can best help the growth of their business\", she confirmed.\nIn January 2023, Arnault was appointed as CEO of Christian Dior Couture, effective in February. She was ranked 45th on Fortune's list of Most Powerful Women in 2023.\n\n\n== Other directorships ==\nGagosian Gallery, member of the board of directors (since 2021)\n20th Century Fox, member of the board of directors (since 2013)\nCéline, member of the board of directors (since 2011)\nPucci, member of the board of directors (since 2007)\nLoewe, member of the board of directors (since 2002)\nFerrari, member of the board of directors\nHavas, member of the board of directors (2013–2019)\n\n\n== Political activities ==\nOn 1 December 2022, Arnault was among the guests invited to the state dinner hosted by American president Joe Biden in honor of French president Emmanuel Macron at the White House.\nAt the second inauguration of Donald Trump in January 2025, Arnault attended the church service with Trump at St. John's Episcopal Church.\n\n\n== Personal life ==\nArnault married Alessandro Vallarino Gancia, heir to the Italian winemaker Gancia, on 24 September 2005. They divorced in 2010.\nArnault has four children – two daughters born 2010 and 2012, and two sons born 2013 and 2017. Her two children with French businessman Xavier Niel, she has briefly mentioned in an interview with Vogue, are named Elise and Joseph. The family resides in the 16th arrondissement of Paris.\n\n\n== References =="
    }
  ],
  "collected_at": "2025-03-29T20:03:50.511824"
}