{
  "basic_info": {
    "id": "bill_gates",
    "name": "Bill Gates",
    "net_worth": "$98 billion",
    "source": "64",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Gates",
    "summary": "William Henry Gates III  (born October 28, 1955) is an American businessman and philanthropist. A pioneer of the microcomputer revolution of the 1970s and 1980s, he co-founded the software company Microsoft in 1975 with his childhood friend Paul Allen. Until 2014, he was the company's largest individual shareholder. Between 1995 and 2017, he was ranked the wealthiest person in the world for 18 out of 24 years, including continuously from 1995 to 2007. His net worth briefly surpassed US$100 billion in 1999, making him the first centibillionaire. On the 2024 Forbes list of the world's billionaires, he was ranked seventh, with an estimated net worth of $128 billion.\nBorn and raised in Seattle, Gates was educated at the private Lakeside School, where he befriended Allen. He enrolled at Harvard College in the fall of 1973 but dropped out after two years when he and Allen co-founded Microsoft. Gates led the company for 25 years as its chairman and chief executive officer. Succeeded as CEO by Steve Ballmer in 2000, he remained chairman of the board of directors until 2014. Over time, he has reduced his role at Microsoft to focus on his work at the Bill & Melinda Gates Foundation, the world's largest private charitable organization, which he and his then-wife Melinda established and co-chaired in 2000. Following his divorce and his ex-wife's resignation as co-chair, the foundation was renamed the Gates Foundation in 2024, with Gates as its sole chair. \nGates is founder and chairman of several other companies, including BEN, Cascade Investment, TerraPower, Gates Ventures, and Breakthrough Energy. In 2010, he and Warren Buffett founded the Giving Pledge, whereby they and other billionaires pledge to give at least half of their wealth to philanthropy.\n\n"
  },
  "biography": {
    "error": "Error code: 404 - {'error': {'message': 'The model `gpt-4-0314` has been deprecated, learn more here: https://platform.openai.com/docs/deprecations', 'type': 'invalid_request_error', 'param': None, 'code': 'model_not_found'}}"
  },
  "business_philosophy": {
    "error": "Error code: 404 - {'error': {'message': 'The model `gpt-4-0314` has been deprecated, learn more here: https://platform.openai.com/docs/deprecations', 'type': 'invalid_request_error', 'param': None, 'code': 'model_not_found'}}"
  },
  "expertise_areas": [],
  "innovation_contributions": [],
  "leadership_style": {},
  "risk_management": {},
  "quotes": [
    {
      "text": "it didn't matter whether it was hearts or pickleball or swimming to the dock; there was always a reward for winning and there was always a penalty for losing",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "if things hadn't worked out, I could always go back to school. I was officially on leave.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "Bill Gates likes the program, not because it's going to make him a lot of money (although I'm sure it will do that), but because it's a neat hack.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "there'll be some really bad things that'll happen in the next 50 or 100 years, but hopefully none of them on the scale of, say, a million people that you didn't expect to die from a pandemic, or nuclear or bioterrorism.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "America's way better today than it's ever been.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "is funding green start-ups and a host of other low-carbon entrepreneurial projects, including everything from advanced nuclear technology to synthetic breast milk.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "which has developed 10-minute Covid lateral flow tests that it aims to make for as little as $1",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "If you gave me the choice between picking the next 10 presidents or ensuring that energy is environmentally friendly and a quarter as costly, I'd pick the energy thing.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "I believe we can make this transition faster, both because the pace of innovation is accelerating, and because we have never had such an urgent reason to move from one source of energy to another.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "Solving for Zero: The Search for Climate Innovation",
      "source": "Wikipedia",
      "context": "From biographical content"
    }
  ],
  "related_articles": [
    {
      "title": "Seattle",
      "url": "https://en.wikipedia.org/wiki/Seattle",
      "summary": "Seattle (  see-AT-əl) is the most populous city in the U.S. state of Washington and in the Pacific Northwest region of North America. With a population of 755,078 in 2023, it is the 18th-most populous city in the United States. The city is the county seat of King County, the most populous county in Washington. The Seattle metropolitan area's population is 4.02 million, making it the 15th-most populous in the United States. Its growth rate of 21.1% between 2010 and 2020 made it one of the country's fastest-growing large cities.\nSeattle is situated on an isthmus between Puget Sound, an inlet of the Pacific Ocean, and Lake Washington. It is the northernmost major city in the United States, located about 100 miles (160 km) south of the Canadian border. A gateway for trade with East Asia, the Port of Seattle is the fourth-largest port in North America in terms of container handling as of 2021.\nThe Seattle area has been inhabited by Native Americans (such as the Duwamish, who had at least 17 villages around Elliot Bay) for at least 4,000 years before the first permanent European settlers. Arthur A. Denny and his group of travelers, subsequently known as the Denny Party, arrived from Illinois via Portland, Oregon, on the schooner Exact at Alki Point on November 13, 1851. The settlement was moved to the eastern shore of Elliott Bay in 1852 and named \"Seattle\" in honor of Chief Seattle, a prominent 19th-century leader of the local Duwamish and Suquamish tribes. Seattle currently has high populations of Native Americans alongside Americans with strong Asian, African, European, and Scandinavian ancestry, and, as of 2015, hosts the fifth-largest LGBT community in the U.S.\nLogging was Seattle's first major industry, but by the late 19th century the city had become a commercial and shipbuilding center as a gateway to Alaska during the Klondike Gold Rush. The city grew after World War II, partly due to the local company Boeing, which established Seattle as a center for its manufacturing of aircraft. Beginning in the 1980s, the Seattle area developed into a technology center; Microsoft established its headquarters in the region. Alaska Airlines is based in SeaTac, Washington, serving Seattle–Tacoma International Airport, Seattle's international airport. The stream of new software, biotechnology, and Internet companies led to an economic revival, which increased the city's population by almost 50,000 in the decade between 1990 and 2000.\nThe culture of Seattle is heavily defined by its significant musical history. Between 1918 and 1951, nearly 24 jazz nightclubs existed along Jackson Street, from the current Chinatown/International District to the Central District. The jazz scene nurtured the early careers of Ernestine Anderson, Ray Charles, Quincy Jones, and others. In the late 20th and early 21st century, the city also was the origin of several rock artists, including Foo Fighters, Heart, and Jimi Hendrix, and the subgenre of grunge and its pioneering bands, including Alice in Chains, Nirvana, Pearl Jam, Soundgarden, and others.",
      "content": "Seattle (  see-AT-əl) is the most populous city in the U.S. state of Washington and in the Pacific Northwest region of North America. With a population of 755,078 in 2023, it is the 18th-most populous city in the United States. The city is the county seat of King County, the most populous county in Washington. The Seattle metropolitan area's population is 4.02 million, making it the 15th-most populous in the United States. Its growth rate of 21.1% between 2010 and 2020 made it one of the country's fastest-growing large cities.\nSeattle is situated on an isthmus between Puget Sound, an inlet of the Pacific Ocean, and Lake Washington. It is the northernmost major city in the United States, located about 100 miles (160 km) south of the Canadian border. A gateway for trade with East Asia, the Port of Seattle is the fourth-largest port in North America in terms of container handling as of 2021.\nThe Seattle area has been inhabited by Native Americans (such as the Duwamish, who had at least 17 villages around Elliot Bay) for at least 4,000 years before the first permanent European settlers. Arthur A. Denny and his group of travelers, subsequently known as the Denny Party, arrived from Illinois via Portland, Oregon, on the schooner Exact at Alki Point on November 13, 1851. The settlement was moved to the eastern shore of Elliott Bay in 1852 and named \"Seattle\" in honor of Chief Seattle, a prominent 19th-century leader of the local Duwamish and Suquamish tribes. Seattle currently has high populations of Native Americans alongside Americans with strong Asian, African, European, and Scandinavian ancestry, and, as of 2015, hosts the fifth-largest LGBT community in the U.S.\nLogging was Seattle's first major industry, but by the late 19th century the city had become a commercial and shipbuilding center as a gateway to Alaska during the Klondike Gold Rush. The city grew after World War II, partly due to the local company Boeing, which established Seattle as a center for its manufacturing of aircraft. Beginning in the 1980s, the Seattle area developed into a technology center; Microsoft established its headquarters in the region. Alaska Airlines is based in SeaTac, Washington, serving Seattle–Tacoma International Airport, Seattle's international airport. The stream of new software, biotechnology, and Internet companies led to an economic revival, which increased the city's population by almost 50,000 in the decade between 1990 and 2000.\nThe culture of Seattle is heavily defined by its significant musical history. Between 1918 and 1951, nearly 24 jazz nightclubs existed along Jackson Street, from the current Chinatown/International District to the Central District. The jazz scene nurtured the early careers of Ernestine Anderson, Ray Charles, Quincy Jones, and others. In the late 20th and early 21st century, the city also was the origin of several rock artists, including Foo Fighters, Heart, and Jimi Hendrix, and the subgenre of grunge and its pioneering bands, including Alice in Chains, Nirvana, Pearl Jam, Soundgarden, and others.\n\n\n== History ==\n\nArchaeological excavations suggest that Native Americans have inhabited the Seattle area for at least 4,000 years. By the time the first European settlers arrived, the Duwamish people occupied at least 17 villages in the areas around Elliott Bay. The name for the modern city of Seattle in Lushootseed, dᶻidᶻəlal̓ič, meaning \"little crossing-over place\", comes from one of these villages, which was located at the present-day King Street Station.\nIn May 1792, George Vancouver was the first European to visit the Seattle area during his 1791–1795 expedition for the Royal Navy, which sought to chart the Pacific Northwest for the British.\n\n\n=== 19th century ===\n\nIn 1851, a large party of American pioneers led by Luther Collins made a location on land at the mouth of the Duwamish River; they formally claimed it on September 14, 1851. Thirteen days later, members of the Collins Party on the way to their claim p"
    },
    {
      "title": "Harvard University",
      "url": "https://en.wikipedia.org/wiki/Harvard_University",
      "summary": "Harvard University is a private Ivy League research university in Cambridge, Massachusetts, United States. Founded October 28, 1636, and named for its first benefactor, the Puritan clergyman John Harvard, it is the oldest institution of higher learning in the United States. Its influence, wealth, and rankings have made it one of the most prestigious universities in the world.\nHarvard was founded and authorized by the Massachusetts General Court, the governing legislature of colonial-era Massachusetts Bay Colony. While never formally affiliated with any denomination, Harvard trained Congregational clergy until its curriculum and student body were gradually secularized in the 18th century.\nBy the 19th century, Harvard emerged as the most prominent academic and cultural institution among the Boston elite. Following the American Civil War, under Harvard president Charles William Eliot's long tenure from 1869 to 1909, Harvard developed multiple professional schools, which transformed it into a modern research university. In 1900, Harvard co-founded the Association of American Universities. James B. Conant led the university through the Great Depression and World War II, and liberalized admissions after the war.\nThe university has ten academic faculties and a faculty attached to Harvard Radcliffe Institute. The Faculty of Arts and Sciences offers study in a wide range of undergraduate and graduate academic disciplines, and other faculties offer graduate degrees, including professional degrees. Harvard has three campuses:\nthe main campus, a 209-acre (85 ha) in Cambridge centered on Harvard Yard; an adjoining campus immediately across Charles River in the Allston neighborhood of Boston; and the medical campus in Boston's Longwood Medical Area. Harvard's endowment, valued at $50.7 billion, makes it the wealthiest academic institution in the world. Harvard Library, with more than 20 million volumes, is the world's largest academic library.\nHarvard alumni, faculty, and researchers include 188 living billionaires, eight U.S. presidents, 24 heads of state and 31 heads of government, founders of notable companies, Nobel laureates, Fields Medalists, members of Congress, MacArthur Fellows, Rhodes Scholars, Marshall Scholars, Turing Award Recipients, Pulitzer Prize recipients, and Fulbright Scholars; by most metrics, Harvard University ranks among the top universities in the world in each of these categories. Harvard students and alumni have also collectively won 10 Academy Awards and 110 Olympic medals, including 46 gold medals.",
      "content": "Harvard University is a private Ivy League research university in Cambridge, Massachusetts, United States. Founded October 28, 1636, and named for its first benefactor, the Puritan clergyman John Harvard, it is the oldest institution of higher learning in the United States. Its influence, wealth, and rankings have made it one of the most prestigious universities in the world.\nHarvard was founded and authorized by the Massachusetts General Court, the governing legislature of colonial-era Massachusetts Bay Colony. While never formally affiliated with any denomination, Harvard trained Congregational clergy until its curriculum and student body were gradually secularized in the 18th century.\nBy the 19th century, Harvard emerged as the most prominent academic and cultural institution among the Boston elite. Following the American Civil War, under Harvard president Charles William Eliot's long tenure from 1869 to 1909, Harvard developed multiple professional schools, which transformed it into a modern research university. In 1900, Harvard co-founded the Association of American Universities. James B. Conant led the university through the Great Depression and World War II, and liberalized admissions after the war.\nThe university has ten academic faculties and a faculty attached to Harvard Radcliffe Institute. The Faculty of Arts and Sciences offers study in a wide range of undergraduate and graduate academic disciplines, and other faculties offer graduate degrees, including professional degrees. Harvard has three campuses:\nthe main campus, a 209-acre (85 ha) in Cambridge centered on Harvard Yard; an adjoining campus immediately across Charles River in the Allston neighborhood of Boston; and the medical campus in Boston's Longwood Medical Area. Harvard's endowment, valued at $50.7 billion, makes it the wealthiest academic institution in the world. Harvard Library, with more than 20 million volumes, is the world's largest academic library.\nHarvard alumni, faculty, and researchers include 188 living billionaires, eight U.S. presidents, 24 heads of state and 31 heads of government, founders of notable companies, Nobel laureates, Fields Medalists, members of Congress, MacArthur Fellows, Rhodes Scholars, Marshall Scholars, Turing Award Recipients, Pulitzer Prize recipients, and Fulbright Scholars; by most metrics, Harvard University ranks among the top universities in the world in each of these categories. Harvard students and alumni have also collectively won 10 Academy Awards and 110 Olympic medals, including 46 gold medals.\n\n\n== History ==\n\n\n=== Colonial era ===\n\nHarvard was founded in 1636 during the colonial, pre-Revolutionary era by vote of the Great and General Court of Massachusetts Bay Colony, one of the original Thirteen Colonies of British America. Its first headmaster, Nathaniel Eaton, took office the following year. In 1638, the university acquired British North America's first known printing press. The same year, on his deathbed, John Harvard, a Puritan clergyman who emigrated to the colony from England, bequeathed the emerging college £780 and his library of some 320 volumes; the following year, it was named Harvard College.\nIn 1643, a Harvard publication defined the college's purpose: \"[to] advance learning and perpetuate it to posterity, dreading to leave an illiterate ministry to the churches when our present ministers shall lie in the dust.\" In its early years, the college trained many Puritan ministers and offered a classical curriculum based on the English university model many colonial-era Massachusetts leaders experienced at the University of Cambridge, where many of them studied prior to immigrating to British America. Harvard never formally affiliated with any particular Protestant denomination, but its curriculum conformed to the tenets of Puritanism. In 1650, the charter for Harvard Corporation, the college's governing body, was granted.\nFrom 1681 to 1701, Increase Mather, a Puritan clergyman, served as Harvard's "
    },
    {
      "title": "History of personal computers",
      "url": "https://en.wikipedia.org/wiki/Personal_computer_revolution",
      "summary": "The history of the personal computer as a mass-market consumer electronic device began with the microcomputer revolution of the 1970s.  A personal computer is one intended for interactive individual use, as opposed to a mainframe computer where the end user's requests are filtered through operating staff, or a time-sharing system in which one large processor is shared by many individuals. After the development of the microprocessor, individual personal computers were low enough in cost that they eventually became affordable consumer goods. Early personal computers – generally called microcomputers – were sold often in electronic kit form and in limited numbers, and were of interest mostly to hobbyists and technicians.",
      "content": "The history of the personal computer as a mass-market consumer electronic device began with the microcomputer revolution of the 1970s.  A personal computer is one intended for interactive individual use, as opposed to a mainframe computer where the end user's requests are filtered through operating staff, or a time-sharing system in which one large processor is shared by many individuals. After the development of the microprocessor, individual personal computers were low enough in cost that they eventually became affordable consumer goods. Early personal computers – generally called microcomputers – were sold often in electronic kit form and in limited numbers, and were of interest mostly to hobbyists and technicians.\n\n\n== Etymology ==\nThere are several competing claims as to the origins of the term \"personal computer\". Yale Law School librarian Fred Shapiro notes an early published use of the phrase in a 1968 Hewlett-Packard advertisement for a programmable calculator, which they called \"The new Hewlett-Packard 9100A personal computer.\" Other claims include computer pioneer Alan Kay's purported use of the term in a 1972 paper, Whole Earth Catalog publisher Stewart Brand's usage in a 1974 book, MITS co-founder Ed Roberts' usage in 1975, and Byte magazine's May 1976 usage of \"[in] the personal computing field\" in its first edition. In 1975, Creative Computing defined the personal computer as a \"non-(time)shared system containing sufficient processing power and storage capabilities to satisfy the needs of an individual user.\"\n\n\n== Overview ==\n\nThe history of the personal computer as mass-market consumer electronic devices effectively began in 1977 with the introduction of microcomputers, although some mainframe and minicomputers had been applied as single-user systems much earlier. A personal computer is one intended for interactive individual use, as opposed to a mainframe computer where the end user's requests are filtered through operating staff, or a time sharing system in which one large processor is shared by many individuals. After the development of the microprocessor, individual personal computers were low enough in cost that they eventually became affordable consumer goods. Early personal computers – generally called microcomputers – were sold often in electronic kit form and in limited numbers, and were of interest mostly to hobbyists and technicians.\n\n\n=== Mainframes, minicomputers, and microcomputers ===\nComputer terminals were used for time sharing access to central computers. Before the introduction of the microprocessor in the early 1970s, computers were generally large, costly systems owned by large corporations, universities, government agencies, and similar-sized institutions. End users generally did not directly interact with the machine, but instead would prepare tasks for the computer on off-line equipment, such as card punches. A number of assignments for the computer would be gathered up and processed in batch mode. After the job had completed, users could collect the results. In some cases, it could take hours or days between submitting a job to the computing center and receiving the output.\nA more interactive form of computer use developed commercially by the middle 1960s. In a time-sharing system, multiple computer terminals let many people share the use of one mainframe computer processor. This was common in business applications and in science and engineering.\nA different model of computer use was foreshadowed by the way in which early, pre-commercial, experimental computers were used, where one user had exclusive use of a processor. In places such as Carnegie Mellon University and MIT, students with access to some of the first computers experimented with applications that would today be typical of a personal computer; for example, computer-aided design and drafting was foreshadowed by T-square, a program written in 1961, and an ancestor of today's computer games was found in Spacewar! in 1962. Some "
    },
    {
      "title": "Paul Allen",
      "url": "https://en.wikipedia.org/wiki/Paul_Allen",
      "summary": "Paul Gardner Allen (January 21, 1953 – October 15, 2018) was an American businessman, computer programmer, researcher, film producer, explorer, sports executive, investor, author, and philanthropist. He co-founded Microsoft Corporation with his childhood friend Bill Gates in 1975, which was followed by the microcomputer revolution of the 1970s and 1980s. Allen was ranked as the 44th-wealthiest person in the world by Forbes with an estimated net worth of $20.3 billion at the time of his death in October 2018.\nAllen quit from day-to-day work at Microsoft in early 1983 after a Hodgkin lymphoma diagnosis, remaining on its board as vice-chairman. He and his sister, Jody Allen, founded Vulcan Inc. in 1986, a privately held company that managed his business and philanthropic efforts. At the time of his death, he had a multi-billion dollar investment portfolio, including technology and media companies, scientific research, real estate holdings, private space flight ventures, and stakes in other sectors. He owned the Seattle Seahawks of the National Football League and the Portland Trail Blazers of the National Basketball Association, and was part-owner of the Seattle Sounders FC of Major League Soccer. Under Allen's helm, the Seahawks won Super Bowl XLVIII and made it to two other Super Bowls (XL and XLIX). In 2000 he resigned from his position on Microsoft's board and assumed the post of senior strategy advisor to the company's management team.\nAllen founded the Allen Institutes for Brain Science, Artificial Intelligence, and Cell Science, as well as companies like Stratolaunch Systems and Apex Learning. He gave more than $2 billion to causes such as education, wildlife and environmental conservation, the arts, healthcare, and community services. In 2004, he funded the first crewed private spaceplane with SpaceShipOne. He received numerous awards and honors, and was listed among the Time 100 Most Influential People in the World in 2007 and 2008.\nAllen was diagnosed with non-Hodgkin lymphoma in 2009. He died of septic shock related to cancer on October 15, 2018, at the age of 65. Shortly after his death, in April 2019, the Allen-funded Stratolaunch first flew and became the largest aircraft in history by wingspan.\n\n",
      "content": "Paul Gardner Allen (January 21, 1953 – October 15, 2018) was an American businessman, computer programmer, researcher, film producer, explorer, sports executive, investor, author, and philanthropist. He co-founded Microsoft Corporation with his childhood friend Bill Gates in 1975, which was followed by the microcomputer revolution of the 1970s and 1980s. Allen was ranked as the 44th-wealthiest person in the world by Forbes with an estimated net worth of $20.3 billion at the time of his death in October 2018.\nAllen quit from day-to-day work at Microsoft in early 1983 after a Hodgkin lymphoma diagnosis, remaining on its board as vice-chairman. He and his sister, Jody Allen, founded Vulcan Inc. in 1986, a privately held company that managed his business and philanthropic efforts. At the time of his death, he had a multi-billion dollar investment portfolio, including technology and media companies, scientific research, real estate holdings, private space flight ventures, and stakes in other sectors. He owned the Seattle Seahawks of the National Football League and the Portland Trail Blazers of the National Basketball Association, and was part-owner of the Seattle Sounders FC of Major League Soccer. Under Allen's helm, the Seahawks won Super Bowl XLVIII and made it to two other Super Bowls (XL and XLIX). In 2000 he resigned from his position on Microsoft's board and assumed the post of senior strategy advisor to the company's management team.\nAllen founded the Allen Institutes for Brain Science, Artificial Intelligence, and Cell Science, as well as companies like Stratolaunch Systems and Apex Learning. He gave more than $2 billion to causes such as education, wildlife and environmental conservation, the arts, healthcare, and community services. In 2004, he funded the first crewed private spaceplane with SpaceShipOne. He received numerous awards and honors, and was listed among the Time 100 Most Influential People in the World in 2007 and 2008.\nAllen was diagnosed with non-Hodgkin lymphoma in 2009. He died of septic shock related to cancer on October 15, 2018, at the age of 65. Shortly after his death, in April 2019, the Allen-funded Stratolaunch first flew and became the largest aircraft in history by wingspan.\n\n\n== Early life ==\n\nAllen was born on January 21, 1953, in Seattle, Washington, to Kenneth Sam Allen (a librarian) and Edna Faye (née Gardner) Allen (a fourth-grade teacher). From 1965 to 1971 he attended Lakeside School, a private school in Seattle where he befriended Bill Gates, with whom he shared an enthusiasm for computers. They used Lakeside's Teletype terminals to develop their programming skills on several time-sharing computer systems. They also used the laboratory of the Computer Science Department of the University of Washington for personal research and computer programming until they were banned in 1971 for abusing their privileges.\nGates and Allen joined with Ric Weiland and Gates' childhood best friend and first collaborator, Kent Evans, to form the Lakeside Programming Club and find bugs in Computer Center Corporation's software, in exchange for extra computer time. In 1972, after Evans' sudden death due to a mountain climbing accident, Gates turned to Allen for help finishing an automated class scheduling system for Lakeside. They then formed Traf-O-Data to make traffic counters based on the Intel 8008 processor. According to Allen, he and Gates would go dumpster diving during their teenage years for computer program code.\nAllen achieved a perfect SAT score of 1600 and went to Washington State University, where he joined the Phi Kappa Theta fraternity. He dropped out of college after two years to work as a programmer for Honeywell in Boston near Harvard University where Gates was enrolled. Allen convinced Gates to drop out of Harvard in order to found Microsoft.\n\n\n== Microsoft ==\n\nAllen and Gates formed Microsoft in 1975 in Albuquerque, New Mexico, and began marketing a BASIC programming language interpreter"
    }
  ],
  "collected_at": "2025-03-29T20:04:09.279267"
}