{
  "basic_info": {
    "id": "david_koch",
    "name": "David Koch",
    "net_worth": "$42.9 billion",
    "source": "74",
    "wikipedia_url": "https://en.wikipedia.org/wiki/David_Koch",
    "summary": "David Hamilton Koch ( KOHK; May 3, 1940 – August 23, 2019) was an American businessman, political activist, philanthropist, and chemical engineer. In 1970, he joined the family business: Koch Industries, the second largest privately held company in the United States. He became president of the subsidiary Koch Engineering in 1979 and became a co-owner of Koch Industries (along with elder brother Charles) in 1983. Koch served as an executive vice president of Koch Industries until he retired due to health issues in 2018.\nKoch was a libertarian. He was the 1980 Libertarian candidate for Vice President of the United States and helped finance the campaign. He founded Citizens for a Sound Economy and donated to advocacy groups and political campaigns, most of which were Republican. Koch became a Republican in 1984; in 2012, he spent over $100 million in a failed bid to oppose the re-election of President Barack Obama.\nKoch was the fourth-richest person in the United States in 2012 and was the wealthiest resident of New York City in 2013. As of June 2019, Koch was ranked as the 11th-richest person in the world (tied with his brother Charles), with a fortune of $50.5 billion. Koch contributed to the Lincoln Center, Sloan Kettering, NewYork–Presbyterian Hospital, and the Dinosaur Wing at the American Museum of Natural History. The New York State Theater at Lincoln Center, home of the New York City Ballet, was renamed the David H. Koch Theater in 2008 following Koch's gift of $100 million for the renovation of the theater."
  },
  "biography": {
    "error": "\n\nYou tried to access openai.ChatCompletion, but this is no longer supported in openai>=1.0.0 - see the README at https://github.com/openai/openai-python for the API.\n\nYou can run `openai migrate` to automatically upgrade your codebase to use the 1.0.0 interface. \n\nAlternatively, you can pin your installation to the old version, e.g. `pip install openai==0.28`\n\nA detailed migration guide is available here: https://github.com/openai/openai-python/discussions/742\n"
  },
  "business_philosophy": {
    "error": "\n\nYou tried to access openai.ChatCompletion, but this is no longer supported in openai>=1.0.0 - see the README at https://github.com/openai/openai-python for the API.\n\nYou can run `openai migrate` to automatically upgrade your codebase to use the 1.0.0 interface. \n\nAlternatively, you can pin your installation to the old version, e.g. `pip install openai==0.28`\n\nA detailed migration guide is available here: https://github.com/openai/openai-python/discussions/742\n"
  },
  "expertise_areas": [],
  "innovation_contributions": [],
  "leadership_style": {},
  "risk_management": {},
  "quotes": [
    {
      "text": "Compared to what [the Libertarians had] gotten before,",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "and where we were as a movement or as a political/ideological point of view, that was pretty remarkable, to get 1 percent of the vote.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "We'd like to abolish the Federal Election Commission and all the limits on campaign spending anyway,",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "Lord knows I didn't need a job, but I believe in what the Libertarians are saying. I suppose if they hadn't come along, I could have been a big Republican from Wichita. But hell — everybody from Kansas is a Republican.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "We're helping him, as we should. We've gotten pretty good at this over the years. We've spent a lot of money in Wisconsin. We're going to spend more,",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "Earth will be able to support enormously more people, because a far greater land area will be available to produce food",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "cost a lot of money and it's taken so many American lives",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "I question whether that was the right thing to do. In hindsight that looks like it was not a good policy.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "cut the hell out of spending, balance the budget, reduce regulations, and support business",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "the most radical president we've ever had as a nation ... and has done more damage to the free enterprise system and long-term prosperity than any president we've ever had",
      "source": "Wikipedia",
      "context": "From biographical content"
    }
  ],
  "collected_at": "2025-03-29T19:26:49.503018"
}