{
  "basic_info": {
    "id": "elon_musk",
    "name": "Elon Musk",
    "net_worth": "$180 billion",
    "source": "51",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Elon_Musk",
    "summary": "Elon Reeve Musk ( EE-lon; born June 28, 1971) is a businessman known for his key roles in Tesla, SpaceX, PayPal, OpenAI and Twitter (which he rebranded as X). Since 2025, he has been a senior advisor to United States president Donald Trump and the de facto head of the Department of Government Efficiency (DOGE). Musk is the wealthiest person in the world; as of March 2025, Forbes estimates his net worth to be $320 billion USD. \nBorn to a wealthy family in Pretoria, South Africa, Musk emigrated in 1989 to Canada, whose citizenship he had inherited through his mother. He graduated from the University of Pennsylvania in the U.S. before moving to California to pursue business ventures. In 1995, Musk co-founded the software company Zip2. Following its sale in 1999, he co-founded X.com, an online payment company that later merged to form PayPal, which was acquired by eBay in 2002 for $1.5 billion. That year, Musk also became a U.S. citizen.\nIn 2002, Musk founded SpaceX and became its CEO and chief engineer. The company has since led innovations in reusable rockets and commercial spaceflight. In 2004, Musk joined Tesla, Inc. as an early investor, and became its CEO and product architect in 2008; it has become a market leader in electric vehicles. In 2015, he co-founded OpenAI to advance artificial intelligence research, but left its board in 2018. In 2016, Musk co-founded Neuralink, a company focused on brain–computer interfaces, and in 2017 launched the Boring Company, which aims to develop tunnel transportation. Musk was named Time magazine's Person of the Year in 2021. In 2022, he acquired Twitter, implementing significant changes and rebranding it as X in 2023. In January 2025, he was appointed head of Trump's newly created DOGE.\nMusk's political activities and views have made him a polarizing figure. He has been criticized for making unscientific and misleading statements, including COVID-19 misinformation and promoting conspiracy theories. His acquisition of Twitter (now X) was controversial due to a subsequent increase in hate speech and the spread of misinformation on the service. He has engaged in political activities in several countries, including as a vocal and financial supporter of Trump. Musk was the largest donor in the 2024 U.S. presidential election and is a supporter of global far-right figures, causes, and political parties."
  },
  "biography": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "business_philosophy": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "expertise_areas": [],
  "innovation_contributions": [],
  "leadership_style": {},
  "risk_management": {},
  "quotes": [
    {
      "text": "a portion of the emeralds produced at three small mines",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "The boy had just lost his father to suicide and Elon had called him stupid. Elon had a tendency to call people stupid. How could I possibly blame that child?",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "The website was up during the day and I was coding it at night, seven days a week, all the time.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "My heart goes out to you. It is thanks to you that the future of civilization is assured.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "The 'everyone is Hitler' attack is sooo tired",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "is not an employee of the U.S. DOGE Service or U.S. DOGE Service Temporary Organization",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "is not the U.S. DOGE Service administrator",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "no actual or formal authority to make government decisions himself",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "Tesla's solar roof production volumes and its stock price",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "a small amount once every other week or something like that",
      "source": "Wikipedia",
      "context": "From biographical content"
    }
  ],
  "related_articles": [
    {
      "title": "Incumbent",
      "url": "https://en.wikipedia.org/wiki/Incumbent",
      "summary": "The incumbent is the current holder of an office or position. In an election, the incumbent is the person holding or acting in the position that is up for election, regardless of whether they are seeking re-election.\nThere may or may not be an incumbent on the ballot: the previous holder may have died, retired, resigned; they may not seek re-election, be barred from re-election due to term limits, or a new electoral division or position may have been created, at which point the office or position is regarded as vacant or open. In the United States, an election without an incumbent on the ballot is an open seat or open contest.",
      "content": "The incumbent is the current holder of an office or position. In an election, the incumbent is the person holding or acting in the position that is up for election, regardless of whether they are seeking re-election.\nThere may or may not be an incumbent on the ballot: the previous holder may have died, retired, resigned; they may not seek re-election, be barred from re-election due to term limits, or a new electoral division or position may have been created, at which point the office or position is regarded as vacant or open. In the United States, an election without an incumbent on the ballot is an open seat or open contest.\n\n\n== Etymology ==\nThe word \"incumbent\" is derived from the Latin verb incumbere, literally meaning \"to lean or lay upon\" with the present participle stem incumbent-, \"leaning a variant of encumber, while encumber is derived from the root cumber, most appropriately defined: \"To occupy obstructively or inconveniently; to block fill up with what hinders freedom of motion or action; to burden, load.\"\n\n\n== Incumbency advantage ==\nIn general, an incumbent has a political advantage over challengers at elections. Except when the timing of elections is determined by a constitution or by legislation, the incumbent in some countries may have the right to determine the date of an election.\nFor most political offices, the incumbent often has more name recognition due to their previous work in the office. Incumbents also have easier access to campaign finance, as well as government resources (such as the franking privilege) that can be indirectly used to boost the incumbent's re-election campaign.\nIn the United States, an election (especially for a single-member constituency in a legislature) in which an incumbent is not seeking re-election is often called an open seat; because of the lack of incumbency advantage, these are often amongst the most hotly contested races in any election. Also, an open contest is created when the term of office is limited, as in the case of terms of the U.S. president being restricted to two four-year terms, and the incumbent is prohibited from recontesting. Although the expected advantage of incumbency has gone from about two percentage points in the 1950s, to ten percentage points in the 1980s and 1990s, and then back to about two percentage points in the 2010s and 2020s, the probability that an incumbent will lose his or her seat has remained approximately the same over the entire period.\nWhen newcomers look to fill an open office, voters tend to compare and contrast the candidates' qualifications, positions on political issues, and personal characteristics in a relatively straightforward way. Elections featuring an incumbent, on the other hand, are, as Guy Molyneux puts it, \"fundamentally a referendum on the incumbent.\" Voters will first grapple with the record of the incumbent. Only if they decide to \"fire\" the incumbent do they begin to evaluate whether each of the challengers is an acceptable alternative.\nA 2017 study in the British Journal of Political Science argues that the incumbency advantage stems from the fact that voters evaluate the incumbent's ideology individually whereas they assume that any challenger shares his party's ideology. This means that the incumbency advantage gets more significant as political polarization increases. A 2017 study in the Journal of Politics found that incumbents have \"a far larger advantage\" in on-cycle elections than in off-cycle elections.\n\n\n=== Business usage ===\nIn relation to business operations and competition, an incumbent supplier is usually the supplier who currently supplies the needs of a customer and therefore has an advantageous position in relation to maintaining this role or agreeing a new contract, in comparison with competing businesses.\n\n\n=== Sophomore surge ===\n\nPolitical analysts in the United States and United Kingdom have noted the existence of a sophomore surge (not known as such in the United Kingdom) in which first te"
    },
    {
      "title": "Donald Trump",
      "url": "https://en.wikipedia.org/wiki/Donald_Trump",
      "summary": "Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who is the 47th president of the United States. A member of the Republican Party, he served as the 45th president from 2017 to 2021.\nBorn in New York City, Trump graduated from the University of Pennsylvania in 1968 with a bachelor's degree in economics. He became the president of his family's real estate business in 1971, renamed it the Trump Organization, and began acquiring and building skyscrapers, hotels, casinos, and golf courses. After six business bankruptcies in the 1990s and 2000s, he began side ventures. From 2004 to 2015, he hosted the reality television show The Apprentice. A political outsider, Trump won the 2016 presidential election against Democratic nominee Hillary Clinton.\nDuring his first term, Trump imposed a travel ban on citizens from six Muslim-majority countries, expanded the U.S.–Mexico border wall, and implemented a family separation policy. He rolled back environmental and business regulations, signed the Tax Cuts and Jobs Act, and appointed three Supreme Court justices. In foreign policy, Trump withdrew the U.S. from agreements on climate, trade, and Iran's nuclear program, began a trade war with China, and met with North Korean leader Kim Jong Un without reaching a deal on denuclearization. In response to the COVID-19 pandemic, he downplayed its severity, contradicted health officials, and signed the CARES Act stimulus. Trump was impeached in 2019 for abuse of power and obstruction of Congress, and in 2021 for incitement of insurrection; the Senate acquitted him in both cases. After his first term, scholars and historians ranked him as one of the worst presidents in American history.\nTrump is the central figure of Trumpism. Many of his comments and actions have been characterized as racist or misogynistic. He has made false and misleading statements and promoted conspiracy theories to a degree unprecedented in American politics. After losing the 2020 presidential election to Joe Biden, Trump attempted to overturn the outcome, culminating in the January 6 Capitol attack in 2021. In 2023, Trump was found liable in civil cases for sexual abuse and defamation and for business fraud, and in 2024, he was found guilty of falsifying business records, making him the first U.S. president convicted of a felony. After winning the 2024 presidential election against Kamala Harris, Trump was sentenced to a penalty-free discharge, and two other felony indictments against him were dismissed.\nHe began his second term by pardoning around 1,500 January 6 rioters, initiating mass layoffs of the federal workforce, and imposing tariffs including starting a trade war with Mexico and Canada. Trump's broad and extensive use of executive orders has drawn numerous lawsuits challenging their legality.\n\n",
      "content": "Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who is the 47th president of the United States. A member of the Republican Party, he served as the 45th president from 2017 to 2021.\nBorn in New York City, Trump graduated from the University of Pennsylvania in 1968 with a bachelor's degree in economics. He became the president of his family's real estate business in 1971, renamed it the Trump Organization, and began acquiring and building skyscrapers, hotels, casinos, and golf courses. After six business bankruptcies in the 1990s and 2000s, he began side ventures. From 2004 to 2015, he hosted the reality television show The Apprentice. A political outsider, Trump won the 2016 presidential election against Democratic nominee Hillary Clinton.\nDuring his first term, Trump imposed a travel ban on citizens from six Muslim-majority countries, expanded the U.S.–Mexico border wall, and implemented a family separation policy. He rolled back environmental and business regulations, signed the Tax Cuts and Jobs Act, and appointed three Supreme Court justices. In foreign policy, Trump withdrew the U.S. from agreements on climate, trade, and Iran's nuclear program, began a trade war with China, and met with North Korean leader Kim Jong Un without reaching a deal on denuclearization. In response to the COVID-19 pandemic, he downplayed its severity, contradicted health officials, and signed the CARES Act stimulus. Trump was impeached in 2019 for abuse of power and obstruction of Congress, and in 2021 for incitement of insurrection; the Senate acquitted him in both cases. After his first term, scholars and historians ranked him as one of the worst presidents in American history.\nTrump is the central figure of Trumpism. Many of his comments and actions have been characterized as racist or misogynistic. He has made false and misleading statements and promoted conspiracy theories to a degree unprecedented in American politics. After losing the 2020 presidential election to Joe Biden, Trump attempted to overturn the outcome, culminating in the January 6 Capitol attack in 2021. In 2023, Trump was found liable in civil cases for sexual abuse and defamation and for business fraud, and in 2024, he was found guilty of falsifying business records, making him the first U.S. president convicted of a felony. After winning the 2024 presidential election against Kamala Harris, Trump was sentenced to a penalty-free discharge, and two other felony indictments against him were dismissed.\nHe began his second term by pardoning around 1,500 January 6 rioters, initiating mass layoffs of the federal workforce, and imposing tariffs including starting a trade war with Mexico and Canada. Trump's broad and extensive use of executive orders has drawn numerous lawsuits challenging their legality.\n\n\n== Early life and education ==\n \nDonald John Trump was born on June 14, 1946, at Jamaica Hospital in the New York City borough of Queens, the fourth child of Fred Trump and Mary Anne MacLeod Trump. He is of German and Scottish descent. He grew up with his older siblings, Maryanne, Fred Jr., and Elizabeth, and his younger brother, Robert, in a mansion in the Jamaica Estates neighborhood of Queens. Fred Trump paid his children each about $20,000 a year, equivalent to $265,000 a year in 2024. Trump was a millionaire at age eight by contemporary standards.\nTrump attended the private Kew-Forest School through seventh grade. He was a difficult child and showed an early interest in his father's business. His father enrolled him in New York Military Academy, a private boarding school, to complete secondary school. Trump considered a show business career but instead in 1964 enrolled at Fordham University. Two years later, he transferred to the Wharton School of the University of Pennsylvania, graduating in May 1968 with a Bachelor of Science in economics. He was exempted from the draft during the Vietnam War due to a claim of bone spurs"
    },
    {
      "title": "Pretoria",
      "url": "https://en.wikipedia.org/wiki/Pretoria",
      "summary": "Pretoria ( prih-TOR-ee-ə, pree-; Afrikaans: [prəˈtuəria] ) is South Africa's administrative capital, serving as the seat of the executive branch of government, and as the host to all foreign embassies to South Africa.\nPretoria straddles the Apies River and extends eastward into the foothills of the Magaliesberg mountains. It has a reputation as an academic city and centre of research, being home to the Tshwane University of Technology (TUT), the University of Pretoria (UP), the University of South Africa (UNISA), the Council for Scientific and Industrial Research (CSIR), and the Human Sciences Research Council. It also hosts the National Research Foundation and the South African Bureau of Standards. Pretoria was one of the host cities of the 2010 FIFA World Cup.\nPretoria is the central part of the City of Tshwane Metropolitan Municipality which was formed by the amalgamation of several former local authorities, including Bronkhorstspruit, Centurion, Cullinan, Hammanskraal and Soshanguve. Some have proposed changing the official name from Pretoria to Tshwane, which has caused some public controversy.\nPretoria is named after the Voortrekker leader Andries Pretorius, and South Africans sometimes call it the \"Jacaranda City\", because of the thousands of jacaranda trees planted along its streets and in its parks and gardens.",
      "content": "Pretoria ( prih-TOR-ee-ə, pree-; Afrikaans: [prəˈtuəria] ) is South Africa's administrative capital, serving as the seat of the executive branch of government, and as the host to all foreign embassies to South Africa.\nPretoria straddles the Apies River and extends eastward into the foothills of the Magaliesberg mountains. It has a reputation as an academic city and centre of research, being home to the Tshwane University of Technology (TUT), the University of Pretoria (UP), the University of South Africa (UNISA), the Council for Scientific and Industrial Research (CSIR), and the Human Sciences Research Council. It also hosts the National Research Foundation and the South African Bureau of Standards. Pretoria was one of the host cities of the 2010 FIFA World Cup.\nPretoria is the central part of the City of Tshwane Metropolitan Municipality which was formed by the amalgamation of several former local authorities, including Bronkhorstspruit, Centurion, Cullinan, Hammanskraal and Soshanguve. Some have proposed changing the official name from Pretoria to Tshwane, which has caused some public controversy.\nPretoria is named after the Voortrekker leader Andries Pretorius, and South Africans sometimes call it the \"Jacaranda City\", because of the thousands of jacaranda trees planted along its streets and in its parks and gardens.\n\n\n== History ==\n\nPretoria was founded in 1855 by Marthinus Pretorius, a leader of the Voortrekkers, who named it after his father Andries Pretorius and chose a spot on the banks of the Apies rivier (Afrikaans for \"Monkeys river\") to be the new capital of the South African Republic (Dutch: Zuid Afrikaansche Republiek; ZAR). The elder Pretorius had become a national hero of the Voortrekkers after his victory over Dingane and the Zulus in the Battle of Blood River in 1838. The elder Pretorius also negotiated the Sand River Convention (1852), in which the United Kingdom acknowledged the independence of the Transvaal. It became the capital of the South African Republic on 1 May 1860.\nThe founding of Pretoria as the capital of the South African Republic can be seen as marking the end of the Boers' settlement movements of the Great Trek.\n\n\n=== Boer Wars ===\n\nDuring the First Boer War, the city was besieged by Republican forces in December 1880 and March 1881. The peace treaty that ended the war was signed in Pretoria on 3 August 1881 at the Pretoria Convention.\nThe Second Boer War resulted in the end of the Transvaal Republic and start of British hegemony in South Africa. The city surrendered to British forces under Frederick Roberts on 5 June 1900 and the conflict was ended in Pretoria with the signing of the Peace of Vereeniging on 31 May 1902 at Melrose House.\nThe Pretoria Forts were built for the defence of the city just prior to the Second Boer War. Though some of these forts are today in ruins, a number of them have been preserved as national monuments.\n\n\n=== Union of South Africa ===\n\nThe Boer Republics of the ZAR and the Orange River Colony were united with the Cape Colony and Natal Colony in 1910 to become the Union of South Africa. Pretoria then became the administrative capital of the whole of South Africa, with Cape Town serving as the legislative capital and Bloemfontein as the judicial capital. Between 1910 and 1994, the city was also the capital of the province of Transvaal. (As the capital of the ZAR, Pretoria had superseded Potchefstroom in that role.)\nOn 14 October 1931, Pretoria achieved official city status. When South Africa became a republic in 1961, Pretoria remained its administrative capital.\n\n\n== Geography ==\nPretoria is situated approximately 56 km (35 mi) north-northeast of Johannesburg in the northeast of South Africa, in a transitional belt between the plateau of the Highveld to the south and the lower-lying Bushveld to the north. It lies at an altitude of about 1,339 m (4,393 ft) above sea level, in a warm, sheltered, fertile valley, surrounded by the hills of the Magaliesberg range.\n\n\n="
    },
    {
      "title": "Justine Musk",
      "url": "https://en.wikipedia.org/wiki/Justine_Musk",
      "summary": "Jennifer Justine Musk (née Wilson; born September 2, 1972) is a Canadian author. She is the first ex-wife of businessman Elon Musk.",
      "content": "Jennifer Justine Musk (née Wilson; born September 2, 1972) is a Canadian author. She is the first ex-wife of businessman Elon Musk.\n\n\n== Early life ==\nJustine Wilson was born in Peterborough, Ontario, and spent most of her early life there. She attended Queen's University in Kingston, Ontario, and obtained a degree in English literature. \n\n\n== Career ==\nAfter college, Wilson moved to Japan, teaching English as a second language (ESL). She subsequently settled in California.\nWilson is the author of the contemporary fantasy novel BloodAngel, published in 2005 by the Roc Books imprint of Penguin Books. Her second book, Uninvited, was released in 2007 and is an unrelated work intended for young-adult readers. A sequel to BloodAngel, Lord of Bones, was released in 2008. Wilson was one of the first people to use a site like Pinterest to plan out a novel.\nIn a 2007 interview, she identified Margaret Atwood, Joyce Carol Oates, Paul Theroux, George R.R. Martin, Guy Gavriel Kay, and Neil Gaiman as authors to whom she could relate her writings. She also described her books as cross-genre fiction.\n\n\n== Personal life ==\nIn January 2000, Wilson married Elon Musk. Their first child was born in 2002 and died of sudden infant death syndrome (SIDS) at the age of 10 weeks. Through in vitro fertilization, she gave birth to twins in 2004 and triplet boys in 2006. On September 13, 2008, she announced that she and Musk were getting a divorce. She and Musk shared custody of their children.\nWilson later wrote an article for Marie Claire detailing ways she thought the marriage was unhealthy, such as Musk's dismissal of her career ambitions, his description of himself as the \"alpha\" in the relationship, and his pressure for her to become a trophy wife. In 2010, she described herself as a \"model former wife\", and said she was on good terms with Musk's then-wife, Talulah Riley. \nShe has said that she kept the last name Musk for their children's sake. In 2022, one of their twins officially changed her name to Vivian to reflect her gender identity and took Wilson as her surname because she no longer wished to be associated with her father.\n\n\n== Bibliography ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nOfficial website \nJustine Musk at the Internet Speculative Fiction Database"
    }
  ],
  "collected_at": "2025-03-29T20:02:35.301350"
}