{
  "basic_info": {
    "id": "larry_page",
    "name": "Larry Page",
    "net_worth": "$114 billion",
    "source": "51",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Larry_Page",
    "summary": "Lawrence Edward Page (born March 26, 1973) is an American businessman, computer engineer and computer scientist best known for co-founding Google with Sergey Brin.\nPage was chief executive officer of Google from 1997 until August 2001 when he stepped down in favor of Eric Schmidt, and then again from April 2011 until July 2015 when he became CEO of its newly formed parent organization Alphabet Inc. He held that post until December 4, 2019, when he and Brin stepped down from all executive positions and day-to-day roles within the company. He remains an Alphabet board member, employee, and controlling shareholder.\nPage has an estimated net worth of $175 billion as of December  2024, according to the Bloomberg Billionaires Index, and $162.2 billion according to Forbes, making him the sixth-richest person in the world. He has also invested in flying car startups Kitty Hawk and Opener.\nPage is the co-creator and namesake of PageRank, a search ranking algorithm for Google for which he received the Marconi Prize in 2004 along with co-writer Brin.\n\n"
  },
  "biography": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "business_philosophy": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "expertise_areas": [],
  "innovation_contributions": [],
  "leadership_style": {},
  "risk_management": {},
  "quotes": [
    {
      "text": "pioneer in computer science and artificial intelligence",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "was usually a mess, with computers, science, and technology magazines and Popular Science magazines all over the place",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "I remember spending a huge amount of time pouring [sic] over books and magazines",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "In some sense, I feel like music training led to the high-speed legacy of Google for me",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "In music, you're very cognizant of time. Time is like the primary thing",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "If you think about it from a music point of view, if you're a percussionist, you hit something, it's got to happen in milliseconds, fractions of a second",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "play with the stuff lying around",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "first kid in his elementary school to turn in an assignment from a word processor",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "everything in his house apart to see how it worked",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "from a very early age, I also realized I wanted to invent things. So I became interested in technology and business. Probably from when I was 12, I knew I was going to start a company eventually.",
      "source": "Wikipedia",
      "context": "From biographical content"
    }
  ],
  "related_articles": [
    {
      "title": "Larry Page (singer)",
      "url": "https://en.wikipedia.org/wiki/Larry_Page_(singer)",
      "summary": "Leonard Davies (9 November 1936 – 19 April 2024), known professionally as Larry Page, was an English pop singer and record producer, primarily from the late 1950s until the early 1970s and briefly in the 1990s.\n\n",
      "content": "Leonard Davies (9 November 1936 – 19 April 2024), known professionally as Larry Page, was an English pop singer and record producer, primarily from the late 1950s until the early 1970s and briefly in the 1990s.\n\n\n== Biography ==\nLeonard Davies was born in Hayes, Hillingdon, Middlesex in 1936. After changing his name to Larry Page, in honour of Larry Parks, the star of The Jolson Story (1946), the teenager began a recording career as a singer.\nPage tried to magnify his fame through the wearing of unusually large spectacles, as \"Larry Page the Teenage Rage\". The title was originally coined by Jack Bentley, the showbusiness correspondent from The Sunday Pictorial. He toured the United Kingdom with Cliff Richard and appeared at top venues, including the Royal Albert Hall. He was a regular on television programmes such as Six-Five Special and Thank Your Lucky Stars.\nPage later became a successful manager, record producer and record-label owner. Much of his producer/manager success centred on his efforts with the Kinks and the Troggs, and his ownership of Page One Records and Penny Farthing Records. He produced such hits as \"Wild Thing\" along with all the other hits by the Troggs. Apart from the Troggs and the Kinks, the Larry Page Orchestra gave Jimmy Page (later of Led Zeppelin) some early exposure when he played on Kinky Music. In June 1967, the British music magazine NME reported that Page's bid to retain his former 10% interest in the Kinks had been dismissed by London's High Court.\nPage was the producer on Daniel Boone's charting single \"Beautiful Sunday\". In 1972, Page was also involved in producing a song for Chelsea F.C. The song, \"Blue is the Colour\", is still played at the end of home matches.\nAs of the 2000s, Page lived in Avoca Beach, New South Wales, Australia. He died there on 18 April 2024, at the age of 87.\n\n\n== Discography ==\nThe Larry Page Orchestra\n\nKinky Music (1965)\nExecutive Suite (1967)\nFrom Larry with Love (1968)\nInstrumentally Yours (1969)\nPresenting the Larry Page Orchestra (1969)\nThis Is Larry Page (1970)\nTheir Melodies Together (1973)\nTheir Melodies Together Again (1974)\nRampage (1976)\nErotic Soul (1977)\nSkin Heat (1978)\nImagine (1979)\nJohn Paul George Ringo (1996)\nNight Cruising (1998)\n\n\n== See also ==\nThe Kinks' 1965 US tour\n\n\n== References ==\n\n\n== External links ==\nCareer overview by Richie Unterberger at AllMusic\nLarry Page discography at Discogs\nLarry Page Orchestra discography at Discogs\nPage One Records album discography\nLarry Page Productions\nLarry Page at IMDb\nLarry Page Orchestra at IMDb"
    },
    {
      "title": "Lansing, Michigan",
      "url": "https://en.wikipedia.org/wiki/Lansing,_Michigan",
      "summary": "Lansing () is the capital of the U.S. state of Michigan and the most populous city in Ingham County. It is mostly in the county, although portions of the city extend west into Eaton County and north into Clinton County. The 2020 census placed the city's population at 112,644, making it the sixth most populous city in Michigan. The population of its metropolitan statistical area (MSA) was 541,297 at the 2020 census, the third largest in the state after metropolitan Detroit and Grand Rapids. It was named the new state capital of Michigan in 1847, ten years after Michigan became a state.\nThe Lansing metropolitan area, colloquially referred to as \"Mid-Michigan\", is an important center for educational, cultural, governmental, commercial, and industrial functions. Neighboring East Lansing is home to Michigan State University, a public research university with an enrollment of more than 50,000. The area features two medical schools, one veterinary school, two nursing schools, and two law schools. It is the site of the Michigan State Capitol, the state Supreme Court, the Court of Appeals, a federal court, the Library of Michigan and Historical Center, and headquarters of four national insurance companies.\nLansing is the only U.S. state capital (among the 47 located in counties) that is not also a county seat. The seat of government of Ingham County is Mason, but the county maintains some offices in Lansing.",
      "content": "Lansing () is the capital of the U.S. state of Michigan and the most populous city in Ingham County. It is mostly in the county, although portions of the city extend west into Eaton County and north into Clinton County. The 2020 census placed the city's population at 112,644, making it the sixth most populous city in Michigan. The population of its metropolitan statistical area (MSA) was 541,297 at the 2020 census, the third largest in the state after metropolitan Detroit and Grand Rapids. It was named the new state capital of Michigan in 1847, ten years after Michigan became a state.\nThe Lansing metropolitan area, colloquially referred to as \"Mid-Michigan\", is an important center for educational, cultural, governmental, commercial, and industrial functions. Neighboring East Lansing is home to Michigan State University, a public research university with an enrollment of more than 50,000. The area features two medical schools, one veterinary school, two nursing schools, and two law schools. It is the site of the Michigan State Capitol, the state Supreme Court, the Court of Appeals, a federal court, the Library of Michigan and Historical Center, and headquarters of four national insurance companies.\nLansing is the only U.S. state capital (among the 47 located in counties) that is not also a county seat. The seat of government of Ingham County is Mason, but the county maintains some offices in Lansing.\n\n\n== History ==\n\n\n=== Exploration by Europeans ===\nThe first recorded person of European descent to travel through the area that is now Lansing was British fur trader Hugh Heward and his French-Canadian team on April 24, 1790, while canoeing the Grand River. The land that was to become Lansing was surveyed as \"Township 4 North Range 2 West\" in February 1827 in what was then dense forest. It was the last of the county's townships to be surveyed, and the land was not offered for sale until October 1830. There would be no roads to this area for decades to come.\n\n\n=== Founding myth ===\nHistorians have lamented the persistence of a myth about Lansing's founding.\nThe incorrect story of Lansing's beginnings states that in the winter of 1835 and early 1836, two brothers from New York plotted the area now known as REO Town just south of downtown Lansing and named it \"Biddle City\". This land lay in a floodplain and was underwater during the majority of the year. Nevertheless, the brothers went back to Lansing, New York, to sell plots for the town that did not exist. They told the New Yorkers this new \"city\" had an area of 65 blocks, a church and a public and academic square. 16 men bought plots in the nonexistent city, and upon reaching the area later that year found they were the victims of the scam. Many in the group, disappointed and now without funds to move on again, opted to stay and ended up settling around what is now metropolitan Lansing.\nThe story has persisted due to a 1904 newspaper article, which cited a memoir told by Daniel W. Buck, a respected Lansing mayor and son of one of the early pioneers. His story was cited in Michigan pioneer papers and retold in newspaper articles multiple times in the decades that followed. His characterization of the city as being born from a \"land scam\" was incorrect, though his story had some elements of truth as well.\n\n\n=== Origins as a town ===\nThe brothers were William and Jerry Ford. Although they were originally from New York, they were well-respected businessmen who hailed from Jackson and were instrumental during its earliest years.\nIn 1836, they bought 290 acres in the northwest corner of Ingham County. They platted the land and hoped to build a community they named Biddle City, located south of the convergence of the Grand River and the Red Cedar River, in Lansing's present-day REO Town neighborhood. Biddle City's plat map included plans for a public square, church square and academy square. They sold 21 parcels of it — mostly to other Michiganders, not New Yorkers — and buyers understoo"
    },
    {
      "title": "University of Michigan",
      "url": "https://en.wikipedia.org/wiki/University_of_Michigan",
      "summary": "The University of Michigan (U-M, UMich, or Michigan) is a public research university in Ann Arbor, Michigan, United States. Founded in 1817, it is the oldest institution of higher education in the state. The University of Michigan is one of the earliest American research universities and is a founding member of the Association of American Universities. In the fall of 2023, the university employed 8,189 faculty members and enrolled 52,065 students in its programs.\nThe university is classified among \"R1: Doctoral Universities – Very high research activity\". It consists of nineteen colleges and offers 250 degree programs at the undergraduate and graduate levels. The university is accredited by the Higher Learning Commission. In 2021, it ranked third among American universities in research expenditures according to the National Science Foundation.\nThe University of Michigan's athletic teams are collectively known as the Wolverines. They compete in NCAA Division I (FBS) as a member of the Big Ten Conference. The university currently fields varsity teams across 29 NCAA-sanctioned sports. As of 2022, athletes from the university had won 188 medals at the Olympic Games.\nNotable alumni from the university include 8 domestic and foreign heads of state or heads of government, 48 U.S. senators, 218 members of the U.S. House of Representatives, 42 U.S. Cabinet secretaries, and 41 U.S. governors.",
      "content": "The University of Michigan (U-M, UMich, or Michigan) is a public research university in Ann Arbor, Michigan, United States. Founded in 1817, it is the oldest institution of higher education in the state. The University of Michigan is one of the earliest American research universities and is a founding member of the Association of American Universities. In the fall of 2023, the university employed 8,189 faculty members and enrolled 52,065 students in its programs.\nThe university is classified among \"R1: Doctoral Universities – Very high research activity\". It consists of nineteen colleges and offers 250 degree programs at the undergraduate and graduate levels. The university is accredited by the Higher Learning Commission. In 2021, it ranked third among American universities in research expenditures according to the National Science Foundation.\nThe University of Michigan's athletic teams are collectively known as the Wolverines. They compete in NCAA Division I (FBS) as a member of the Big Ten Conference. The university currently fields varsity teams across 29 NCAA-sanctioned sports. As of 2022, athletes from the university had won 188 medals at the Olympic Games.\nNotable alumni from the university include 8 domestic and foreign heads of state or heads of government, 48 U.S. senators, 218 members of the U.S. House of Representatives, 42 U.S. Cabinet secretaries, and 41 U.S. governors.\n\n\n== History ==\n\n\n=== The Catholepistemiad (1817–1821) ===\nThe University of Michigan traces its origins to August 26, 1817, when it was established in the Territory of Michigan as the Catholepistemiad or University of Michigania through a legislative act signed by acting governor and secretary William Woodbridge, chief justice Augustus B. Woodward, and judge John Griffin.: 117  In 1821, by a new enactment, the university itself was created as a \"body politic and corporate,\": 117  maintaining its corporate status through various modifications to its charter.: 11  The term \"Catholepistemiad,\" a neologism derived from a blend of Greek and Latin roots, can be loosely translated as \"School of Universal Knowledge\". This corporation was modeled after the Imperial University of France, an entity established by Napoleon I a decade prior,: 10  and included an array of schools and libraries under a single administration, with the authority to establish additional schools across the territory.: 10  It wasn't until Michigan became a state in 1837 that the corporation focused solely on higher education.\n\nPromptly after the Territory of Michigan's formation in 1805, prominent citizens acknowledged the need for a college. In 1806, Gabriel Richard, who presided over several schools in the Town of Detroit, first petitioned for land to found a college. Although Governor William Hull and Woodward promulgated an act in 1809 to establish public school districts, this preliminary endeavor yielded negligible results. Woodward, aspiring to categorize knowledge (which he termed \"encathol epistemia\"), discussed this with Thomas Jefferson in 1814. In 1817, Woodward drafted a territorial act for the Catholepistemiad, or University of Michigania, which included thirteen professorships, or didaxiim. The act was enacted on August 26, 1817, with Richard appointed vice president and John Monteith as president. Woodward sought funding from the Zion Masonic Lodge, which contributed $250, leading to a total of $5,000 raised for the university.: 12  The cornerstone for the first schoolhouse, situated near the intersection of Bates Street and Congress Street in Detroit, was laid on September 24, 1817, and by the following year, a Lancasterian school, taught by Lemuel Shattuck, and a classical academy were operational. Additional schools were established in Monroe and Mackinaw by the end of September 1817.: 11  In 1821, a new act placed the corporation under the control of a board of trustees. Monteith, no longer president, joined the board, and Richard served on the board until his dea"
    },
    {
      "title": "Bachelor of Science",
      "url": "https://en.wikipedia.org/wiki/B._S.",
      "summary": "A Bachelor of Science (BS, BSc, B.S., B.Sc., SB, or ScB; from the Latin scientiae baccalaureus) is a bachelor's degree that is awarded for programs that generally last three to five years.\nThe first university to admit a student to the degree of Bachelor of Science was the University of London in 1860. In the United States, the Lawrence Scientific School first conferred the degree in 1851, followed by the University of Michigan in 1855. Nathaniel Shaler, who was Harvard's Dean of Sciences, wrote in a private letter that \"the degree of Bachelor of Science came to be introduced into our system through the influence of Louis Agassiz, who had much to do in shaping the plans of this School.\": 48 \nWhether Bachelor of Science or Bachelor of Arts degrees are awarded in particular subjects varies between universities. For example, an economics student may graduate as a Bachelor of Arts in one university but as a Bachelor of Science in another, and occasionally, both options are offered. Some universities follow the Oxford and Cambridge tradition that even graduates in mathematics and the sciences become Bachelors of Arts, while other institutions offer only the Bachelor of Science degree, even in non-science fields.\nAt universities that offer both Bachelor of Arts and Bachelor of Science degrees in the same discipline, the Bachelor of Science degree is usually more focused on that particular discipline and is targeted toward students intending to pursue graduate school or a profession in that discipline.\n\n",
      "content": "A Bachelor of Science (BS, BSc, B.S., B.Sc., SB, or ScB; from the Latin scientiae baccalaureus) is a bachelor's degree that is awarded for programs that generally last three to five years.\nThe first university to admit a student to the degree of Bachelor of Science was the University of London in 1860. In the United States, the Lawrence Scientific School first conferred the degree in 1851, followed by the University of Michigan in 1855. Nathaniel Shaler, who was Harvard's Dean of Sciences, wrote in a private letter that \"the degree of Bachelor of Science came to be introduced into our system through the influence of Louis Agassiz, who had much to do in shaping the plans of this School.\": 48 \nWhether Bachelor of Science or Bachelor of Arts degrees are awarded in particular subjects varies between universities. For example, an economics student may graduate as a Bachelor of Arts in one university but as a Bachelor of Science in another, and occasionally, both options are offered. Some universities follow the Oxford and Cambridge tradition that even graduates in mathematics and the sciences become Bachelors of Arts, while other institutions offer only the Bachelor of Science degree, even in non-science fields.\nAt universities that offer both Bachelor of Arts and Bachelor of Science degrees in the same discipline, the Bachelor of Science degree is usually more focused on that particular discipline and is targeted toward students intending to pursue graduate school or a profession in that discipline.\n\n\n== International differences ==\n\nIn some institutions, there are historical and traditional reasons that govern the granting of BS or BA degrees regardless of the disciplines offered. Georgetown University's School of Foreign Service awards the Bachelor of Science in Foreign Service (BSFS) degrees to all of its undergraduates, although many students major in humanities-oriented fields such as international history or culture and politics. University of Pennsylvania's Wharton School awards the BS in Economics to all of its undergraduates, regardless if the candidates major in economics or not. The London School of Economics offers BSc degrees in practically all subject areas, even those normally associated with the arts and humanities.  Northwestern University's School of Communication grants the Bachelor of Science in Journalism degrees in all of its programs of study, including theater, dance, and radio/television/film. Meanwhile, the Oxbridge universities almost exclusively award the BA as a first degree.\nThe decision to grant a BS or BA degree at some institutions also depends on the constituent colleges, even when the candidate pursues the same or similar subjects. For instance, Cornell University offers a BS degree in computer science from its College of Engineering and a BA degree in computer science from its College of Arts and Sciences. Likewise, for candidates majoring in computer science, Columbia University offers BS degrees for those enrolled in the School of Engineering and Applied Science but awards BA degrees for graduates of Columbia College. At Harvard University, the same undergraduate degree in computer science can be an A.B. if taken at Harvard College or Harvard John A. Paulson School of Engineering and Applied Sciences, and an A.L.B. at Harvard Extension School.\n\n\n=== Argentina ===\nIn Argentina most university degrees are given as a license in a discipline. They are specific to a field and awarded to students upon completion of a course of study which lasts at least four and usually five years. \nIn most cases, at the end of a course and as a mandatory condition for its completion (and ultimately, to obtain a degree), students are compelled to produce an original research project related to their field. This project is usually referred to as a thesis (although the term actually corresponds to post-graduate studies).\n\n\n=== Australia, New Zealand and South Africa ===\nIn Australia, the BSc is generally a three to fo"
    }
  ],
  "collected_at": "2025-03-29T20:03:09.212948"
}