{
  "basic_info": {
    "id": "mukesh_ambani",
    "name": "Mukesh Ambani",
    "net_worth": "$90.7 billion",
    "source": "64",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Mukesh_Ambani",
    "summary": "Mukesh Dhirubhai Ambani (born 19 April 1957) is an Indian billionaire and businessman who is the chairman and managing director of Reliance Industries. He is the richest person in Asia and 9th richest in the world.\nSometimes characterized as a plutocrat, he has attracted both fame and notoriety for reports of market manipulation, political corruption, cronyism, and exploitation.\nIn October 2024, Ambani was ranked 1st on the Forbes list of India's 100 richest tycoons, with a net worth of $119.5 billion.\n\n"
  },
  "biography": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "business_philosophy": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "expertise_areas": [],
  "innovation_contributions": [],
  "leadership_style": {},
  "risk_management": {},
  "quotes": [
    {
      "text": "the kind of professors who made you think out of the box.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "The World's Richest Sports Team Owner",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "the world to [India]'s Gilded Age",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "It is a famous city on the coast of the Indian Sea, towards the Yemen, and it is poor, with no water or pasture. They drink from a spring between it and Aden, about a distance of about today, and despite that, it is bad, except that this place is the port for Indian ships, and merchants gather there for that reason, as it is a town of trade.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "It is a country on the edge of the sea in the furthest part of Yemen.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "This Aden is one of the most fortified cities in Yemen, and it is on the bank of the Indian Sea. It is still a country of trade from the time of the Trabaids, and most of them were built with stones, which is why silk merchants visit it often.",
      "source": "Wikipedia",
      "context": "From biographical content"
    }
  ],
  "related_articles": [
    {
      "title": "Aden",
      "url": "https://en.wikipedia.org/wiki/Aden",
      "summary": "Aden (Arabic: عَدَنْ, romanized: ʿAdan) is a port city located in Yemen in the southern part of the Arabian peninsula, on the north coast of the Gulf of Aden, positioned near the eastern approach to the Red Sea. It is situated approximately 170 km (110 mi) east of the Bab-el-Mandeb strait. With its strategic location on the coastline, Aden serves as a gateway between the Red Sea and the Arabian Sea, making it a crucial maritime hub connecting Africa, Asia, and the Middle East. As of 2023, Aden city has a population of approximately 1,080,000 residents, making it one of the largest cities in Yemen.\nAden is the capital and principal part of Aden Governorate, encompassing eight districts. During the colonial period, the name Aden referred to the area along the north coast of the gulf, encompassing Tawahi, Mualla, Crater, and much of Khor Maksar district. The western harbour peninsula, known as Little Aden, now falls within the Al Buraiqeh district.\n\nBefore gaining independence, Aden comprised distinct sectors: Crater, the original port; Ma'alla, the modern port; Tawahi, formerly \"Steamer Point\"; and Gold Mohur resorts. Khormaksar, on the isthmus connecting Aden to the mainland, hosts diplomatic missions, Aden University's main offices, and Aden International Airport. On the mainland, sectors include Sheikh Othman, an old oasis area; Al-Mansura, a British-planned town; and Madinat ash-Sha'b (formerly Madinat al-Ittihad), the former capital of the South Arabian Federation, now housing a large power/desalination facility and additional Aden University faculties.\nAden encloses the eastern side of a vast, natural harbour that constitutes the modern port. Little Aden was developed as the site of the oil refinery and tanker port. Both were established and operated by British Petroleum until they were turned over to South Yemeni government ownership and control in 1978.\nAden used to be the capital of South Yemen until its unity with North Yemen in 22 May 1990. It is currently the temporary capital of Yemen since the 2014 Coup d'état, hosting some members of the Cabinet of Yemen mainly in al-Maashiq Palace. It is also the seat of the secessionist Southern Transitional Council, which exercises control over the city.\n\n",
      "content": "Aden (Arabic: عَدَنْ, romanized: ʿAdan) is a port city located in Yemen in the southern part of the Arabian peninsula, on the north coast of the Gulf of Aden, positioned near the eastern approach to the Red Sea. It is situated approximately 170 km (110 mi) east of the Bab-el-Mandeb strait. With its strategic location on the coastline, Aden serves as a gateway between the Red Sea and the Arabian Sea, making it a crucial maritime hub connecting Africa, Asia, and the Middle East. As of 2023, Aden city has a population of approximately 1,080,000 residents, making it one of the largest cities in Yemen.\nAden is the capital and principal part of Aden Governorate, encompassing eight districts. During the colonial period, the name Aden referred to the area along the north coast of the gulf, encompassing Tawahi, Mualla, Crater, and much of Khor Maksar district. The western harbour peninsula, known as Little Aden, now falls within the Al Buraiqeh district.\n\nBefore gaining independence, Aden comprised distinct sectors: Crater, the original port; Ma'alla, the modern port; Tawahi, formerly \"Steamer Point\"; and Gold Mohur resorts. Khormaksar, on the isthmus connecting Aden to the mainland, hosts diplomatic missions, Aden University's main offices, and Aden International Airport. On the mainland, sectors include Sheikh Othman, an old oasis area; Al-Mansura, a British-planned town; and Madinat ash-Sha'b (formerly Madinat al-Ittihad), the former capital of the South Arabian Federation, now housing a large power/desalination facility and additional Aden University faculties.\nAden encloses the eastern side of a vast, natural harbour that constitutes the modern port. Little Aden was developed as the site of the oil refinery and tanker port. Both were established and operated by British Petroleum until they were turned over to South Yemeni government ownership and control in 1978.\nAden used to be the capital of South Yemen until its unity with North Yemen in 22 May 1990. It is currently the temporary capital of Yemen since the 2014 Coup d'état, hosting some members of the Cabinet of Yemen mainly in al-Maashiq Palace. It is also the seat of the secessionist Southern Transitional Council, which exercises control over the city.\n\n\n== Etymology ==\nAden is a home and a place for ships, and the word Aden means reside in the place, so the word \"Aden\" means resident, and it is said \"Aden Al-Balad\", meaning the settlement of the country. Among the sayings of geographers about the city:\nYaqut al-Hamwi said: \"It is a famous city on the coast of the Indian Sea, towards the Yemen, and it is poor, with no water or pasture. They drink from a spring between it and Aden, about a distance of about today, and despite that, it is bad, except that this place is the port for Indian ships, and merchants gather there for that reason, as it is a town of trade.\" And it is added to Abyan, which is the opposite of Aden in its entirety.\nIbn Manzur said: \"It is a country on the edge of the sea in the furthest part of Yemen.\"\nIbn Khaldun said: \"This Aden is one of the most fortified cities in Yemen, and it is on the bank of the Indian Sea. It is still a country of trade from the time of the Trabaids, and most of them were built with stones, which is why silk merchants visit it often.\"\n\n\n== History ==\n\n\n=== Antiquity ===\nAden is an ancient port and was mentioned by the Greeks under the name (Ancient Greek: Αραβία Εμπόριον, romanized: Arabia Emporion), which means an Arabic trade port. The port's convenient position on the sea route between India and Europe has made Aden desirable to rulers who sought to possess it at various times throughout history. Known as Eudaemon (Ancient Greek: Ευδαίμων, meaning \"blissful, prosperous\",) in the 1st century BC, it was a transshipping point for the Red Sea trade, but fell on hard times when new shipping practices by-passed it and made the daring direct crossing to India in the 1st century AD, according to the Periplus of the Erythraean Sea. The"
    },
    {
      "title": "Aden Colony",
      "url": "https://en.wikipedia.org/wiki/Colony_of_Aden",
      "summary": "Aden Colony (Arabic: مُسْتْعَمَرَةْ عَدَنْ, romanized: Musta'marat 'Adan) was a crown colony of the United Kingdom from 1937 to 1963 located in the southern part of modern-day Yemen. It consisted of the port city of Aden and also included the outlying islands of Kamaran, Perim and the Khuria Muria archipelago with a total area of 192 km2 (74 sq mi). Initially a key port for the British East India Company, it was annexed by the British in 1839 to secure maritime routes and prevent piracy in the Arabian Sea. Its strategic position at the entrance to the Red Sea made it a vital stopover for ships traveling between Europe, India, and the Far East, especially after the opening of the Suez Canal in 1869. Aden quickly became a major coaling station and transit hub for British shipping, and its significance to the British Empire grew throughout the 19th and early 20th centuries.\nPrior to 1937, Aden had been governed as part of British India (originally as the Aden Settlement subordinate to the Bombay Presidency, and then as a Chief Commissioner's province). In 1 April 1937, Aden was separated from British India to become a Crown colony under the Government of India Act 1935, consisting of the city of Aden and its surrounding areas. The colony experienced rapid development due to its thriving port, but it was also marked by growing civil unrest. Economic inequality, labor strikes, and the rise of Arab nationalism contributed to increasing tensions, which were intensified by the anti-colonial sentiment in the Middle East. During this period, Aden became important for British military and commercial purposes in the region, as well as a base for the Royal Navy and the Royal Air Force. The colony's surrounding hinterland, was governed separately as the Aden Protectorate.\nBy the early 1960s, widespread dissatisfaction with British rule led to the Aden Emergency, a violent uprising against colonial authorities. In 1963, Aden Colony was reconstituted as the State of Aden within the newly created Federation of South Arabia in an attempt to grant limited self-governance, but the unrest continued. The British withdrew in 1967, and the colony was succeeded by the People's Republic of Southern Yemen, marking the end of British control after 128 years of rule.\n\n",
      "content": "Aden Colony (Arabic: مُسْتْعَمَرَةْ عَدَنْ, romanized: Musta'marat 'Adan) was a crown colony of the United Kingdom from 1937 to 1963 located in the southern part of modern-day Yemen. It consisted of the port city of Aden and also included the outlying islands of Kamaran, Perim and the Khuria Muria archipelago with a total area of 192 km2 (74 sq mi). Initially a key port for the British East India Company, it was annexed by the British in 1839 to secure maritime routes and prevent piracy in the Arabian Sea. Its strategic position at the entrance to the Red Sea made it a vital stopover for ships traveling between Europe, India, and the Far East, especially after the opening of the Suez Canal in 1869. Aden quickly became a major coaling station and transit hub for British shipping, and its significance to the British Empire grew throughout the 19th and early 20th centuries.\nPrior to 1937, Aden had been governed as part of British India (originally as the Aden Settlement subordinate to the Bombay Presidency, and then as a Chief Commissioner's province). In 1 April 1937, Aden was separated from British India to become a Crown colony under the Government of India Act 1935, consisting of the city of Aden and its surrounding areas. The colony experienced rapid development due to its thriving port, but it was also marked by growing civil unrest. Economic inequality, labor strikes, and the rise of Arab nationalism contributed to increasing tensions, which were intensified by the anti-colonial sentiment in the Middle East. During this period, Aden became important for British military and commercial purposes in the region, as well as a base for the Royal Navy and the Royal Air Force. The colony's surrounding hinterland, was governed separately as the Aden Protectorate.\nBy the early 1960s, widespread dissatisfaction with British rule led to the Aden Emergency, a violent uprising against colonial authorities. In 1963, Aden Colony was reconstituted as the State of Aden within the newly created Federation of South Arabia in an attempt to grant limited self-governance, but the unrest continued. The British withdrew in 1967, and the colony was succeeded by the People's Republic of Southern Yemen, marking the end of British control after 128 years of rule.\n\n\n== History ==\nOn 18 January 1839, the British East India Company landed Royal Marines at Aden. Their aims were to establish a supply port and stop attacks by Arab pirates against British shipping to India. The British Government thereafter considered Aden to be an important settlement due to its location, as the Royal Navy could easily access the port for resupply and repairs. Later, British influence extended progressively into the hinterland, both west and east, leading to the establishment of the Aden Protectorate.\n\nAden soon became an important transit port and coaling station for trade between British India and the Far East, and Europe. The commercial and strategic importance of Aden increased considerably when the Suez Canal opened in 1869. From then and until the 1960s, the Port of Aden was to be one of the busiest ship-bunkering, duty-free shopping, and trading ports in the world.\nIn 1937, Aden was separated from British India to become a Crown colony, a status that it retained until 1963. It consisted of the port city of Aden and its immediate surroundings (an area of 192 km2 [74 sq mi]). The Aden Settlement, and later Aden Colony, also included the outlying islands of Kamaran (de facto), Perim and Kuria Muria (see map).\nPrior to 1937, Aden had been governed as part of British India (originally as the Aden Settlement under the Bombay Presidency, and then as a Chief Commissioner's province). Under the Government of India Act 1935 the territory was detached from British India, and was re-organised as a separate Crown colony of the United Kingdom; this separation took effect on 1 April 1937.\nThrough the latter years of its existence, Aden Colony was plagued by civil unrest.\n\n\n=== Eliz"
    },
    {
      "title": "Yemen",
      "url": "https://en.wikipedia.org/wiki/Yemen",
      "summary": "Yemen, officially the Republic of Yemen, is a country in West Asia. Located in southern Arabia, it borders Saudi Arabia to the north, Oman to the northeast, the south-easten part of the Arabian Sea to the east, the Gulf of Aden to the south, and the Red Sea to the west, sharing maritime borders with Djibouti, Eritrea, and Somalia across the Horn of Africa. Covering roughly 455,503 square kilometres (175,871 square miles), with a coastline of approximately 2,000 kilometres (1,200 miles), Yemen is the second largest country on the Arabian Peninsula. Sanaa is its constitutional capital and largest city. Yemen's estimated population is 34.7 million, mostly Arab Muslims. It is a member of the Arab League, the United Nations, the Non-Aligned Movement and the Organisation of Islamic Cooperation.\nOwing to its geographic location, Yemen has been at the crossroads of many civilisations for over 7,000 years. In 1200 BCE, the Sabaeans formed a thriving commercial kingdom that colonized parts of modern Ethiopia and Eritrea. In 275 CE, it was succeeded by the Himyarite Kingdom, which spanned much of Yemen's present-day territory and was heavily influenced by Judaism. Christianity arrived in the fourth century, followed by the rapid spread of Islam in the seventh century. From its conversion to Islam, Yemen became a center of Islamic learning, and Yemenite troops played a crucial role in early Islamic conquests. Much of Yemen's architecture survived until modern times. For centuries, it became a primary producer of coffee exported in the port of Mocha. Various dynasties emerged between the 9th and 16th centuries. During the 19th century, the country was divided between the Ottoman and British empires. After World War I, the Kingdom of Yemen was established, which in 1962 became the Yemen Arab Republic (North Yemen) following a coup. In 1967, the British Aden Protectorate became the independent People's Democratic Republic of Yemen (South Yemen), the first and only officially socialist state in the Arab world. In 1990, the two Yemeni states united to form the modern Republic of Yemen, with Ali Abdullah Saleh serving as the first president until his resignation in 2012 in the wake of the Arab Spring.\nSince 2011, Yemen has been enduring a political crisis, marked by street protests against poverty, unemployment, corruption, and President Saleh's plan to amend Yemen's constitution and eliminate the presidential term limit. By 2015, the country became engulfed by an ongoing civil war with multiple entities vying for governance, including the Presidential Leadership Council of the internationally recognized government, and the Houthi movement's Supreme Political Council. This conflict, which has escalated to involve various foreign powers, has led to a severe humanitarian crisis.\nYemen is one of the least developed countries in the world, facing significant obstacles to sustainable development, and is one of the poorest countries in the Middle East and North Africa. In 2019, the United Nations reported that Yemen had the highest number of people in need of humanitarian aid, amounting to about 24 million individuals, or nearly 75% of its population. As of 2020, Yemen ranked highest on the Fragile States Index and second-worst on the Global Hunger Index, surpassed only by the Central African Republic. Additionally, it has the lowest Human Development Index out of all non-African countries. Yemen is one of the world's most vulnerable countries to climate change and among the least prepared to handle its effects.",
      "content": "Yemen, officially the Republic of Yemen, is a country in West Asia. Located in southern Arabia, it borders Saudi Arabia to the north, Oman to the northeast, the south-easten part of the Arabian Sea to the east, the Gulf of Aden to the south, and the Red Sea to the west, sharing maritime borders with Djibouti, Eritrea, and Somalia across the Horn of Africa. Covering roughly 455,503 square kilometres (175,871 square miles), with a coastline of approximately 2,000 kilometres (1,200 miles), Yemen is the second largest country on the Arabian Peninsula. Sanaa is its constitutional capital and largest city. Yemen's estimated population is 34.7 million, mostly Arab Muslims. It is a member of the Arab League, the United Nations, the Non-Aligned Movement and the Organisation of Islamic Cooperation.\nOwing to its geographic location, Yemen has been at the crossroads of many civilisations for over 7,000 years. In 1200 BCE, the Sabaeans formed a thriving commercial kingdom that colonized parts of modern Ethiopia and Eritrea. In 275 CE, it was succeeded by the Himyarite Kingdom, which spanned much of Yemen's present-day territory and was heavily influenced by Judaism. Christianity arrived in the fourth century, followed by the rapid spread of Islam in the seventh century. From its conversion to Islam, Yemen became a center of Islamic learning, and Yemenite troops played a crucial role in early Islamic conquests. Much of Yemen's architecture survived until modern times. For centuries, it became a primary producer of coffee exported in the port of Mocha. Various dynasties emerged between the 9th and 16th centuries. During the 19th century, the country was divided between the Ottoman and British empires. After World War I, the Kingdom of Yemen was established, which in 1962 became the Yemen Arab Republic (North Yemen) following a coup. In 1967, the British Aden Protectorate became the independent People's Democratic Republic of Yemen (South Yemen), the first and only officially socialist state in the Arab world. In 1990, the two Yemeni states united to form the modern Republic of Yemen, with Ali Abdullah Saleh serving as the first president until his resignation in 2012 in the wake of the Arab Spring.\nSince 2011, Yemen has been enduring a political crisis, marked by street protests against poverty, unemployment, corruption, and President Saleh's plan to amend Yemen's constitution and eliminate the presidential term limit. By 2015, the country became engulfed by an ongoing civil war with multiple entities vying for governance, including the Presidential Leadership Council of the internationally recognized government, and the Houthi movement's Supreme Political Council. This conflict, which has escalated to involve various foreign powers, has led to a severe humanitarian crisis.\nYemen is one of the least developed countries in the world, facing significant obstacles to sustainable development, and is one of the poorest countries in the Middle East and North Africa. In 2019, the United Nations reported that Yemen had the highest number of people in need of humanitarian aid, amounting to about 24 million individuals, or nearly 75% of its population. As of 2020, Yemen ranked highest on the Fragile States Index and second-worst on the Global Hunger Index, surpassed only by the Central African Republic. Additionally, it has the lowest Human Development Index out of all non-African countries. Yemen is one of the world's most vulnerable countries to climate change and among the least prepared to handle its effects.\n\n\n== Etymology ==\n\nThe term Yamnat was first mentioned in the Old South Arabian inscriptions on the title of one of the kings of the second Himyarite Kingdom known as Shammar Yahri'sh. The term probably referred to the southwestern coastline of the Arabian Peninsula and the southern coastline between Aden and Hadhramaut. Historical Yemen included much greater territory than the current nation, stretching from northern 'Asir in southwestern Sa"
    },
    {
      "title": "Institute of Chemical Technology",
      "url": "https://en.wikipedia.org/wiki/Institute_of_Chemical_Technology",
      "summary": "Institute of Chemical Technology (ICT) is a public deemed university in Mumbai, India. It is focused on training and research in the fields of chemical engineering, chemical technology, and pharmaceutical sciences. \nEstablished in 1933, the institute was granted deemed university status in 2008, making it the only state-funded deemed university in India. In 2018, ICT was named an institute with a special status per the Empowered Expert Committee and was given the status of Category 1 institute with graded autonomy by the Ministry of Human Resource Development and the University Grants Commission (India). \nThe institute also has regional campuses at Bhubaneswar, Odisha and Jalna, Maharashtra.\n\n",
      "content": "Institute of Chemical Technology (ICT) is a public deemed university in Mumbai, India. It is focused on training and research in the fields of chemical engineering, chemical technology, and pharmaceutical sciences. \nEstablished in 1933, the institute was granted deemed university status in 2008, making it the only state-funded deemed university in India. In 2018, ICT was named an institute with a special status per the Empowered Expert Committee and was given the status of Category 1 institute with graded autonomy by the Ministry of Human Resource Development and the University Grants Commission (India). \nThe institute also has regional campuses at Bhubaneswar, Odisha and Jalna, Maharashtra.\n\n\n== History ==\n\n\n=== Founding ===\nIn 1921, the Sir M. Visvesvaraya Committee recommended an institution of the Faculty of Technology at University of Mumbai and a college of technology in Bombay. In 1930, Kanaiyalal Maneklal Munshi's motion in the Academic Council for the institution of a Department of Chemical Technology was accepted. In 1932, Schemes for two-year post-B.Sc. courses in Textile Chemistry and in Chemical Engineering leading to a B.Sc. (Tech) degree and the subsequent M.Sc. (Tech) and Ph.D. (Tech) degrees by research were approved.\nThe ICT was founded on 1 October 1933, as University Department of Chemical and Technology (UDCT) of the University of Mumbai by then vice chancellor Sir Vitthal N. Chandavarkar. Since he was also the Chairman of Mill Owners' Association, Chandavarkar was keen on catering to the needs of Mumbai's bustling textile industry. The institute offered admissions to 15 students in 2 two-year post-B.Sc. degree courses, B.Sc. (Tech) in Textile Chemistry and B.Sc. (Tech) in Chemical Engineering. These courses were started in the then Royal Institute of Science, Fort, Mumbai (now renamed as The Institute of Science, Mumbai), since the department's own building had not begun construction. Robert B. Forster of the University of Leeds became a Professor of Chemical Technology and the first Head of the Department on 26 October 1933. Krishnasami Venkataraman became the first Indian director of the institute on 8 November 1938. The first Ph.D. (Tech) and Ph.D. (Sci) degrees were awarded by the department in 1940 and 1941, respectively. The foundation stone for the department's own building was laid in Matunga, Mumbai on 17 March 1941.\n\n\n=== Expansion ===\nThe current campus in Matunga was occupied in June 1943. In 1944, other specializations:  Pharmaceuticals and Fine Chemicals; Chemistry of Food and Drugs; Technology of Intermediates and Dyes; Technology of Oils, Fats and Waxes; and Technology of Plastics, Paints and Varnishes were added to the B. Sc. (Tech) course. In 1948, B.Sc. (Tech) (Technology of Plastics) and B.Sc. (Tech.) (Technology of Paints, Pigments, and Varnishes) replaced the B.Sc. (Tech) (Technology of Plastics, Paints and Varnishes). In 1949, the B.Sc. (Tech) course in the Chemistry of Foods and Drugs re-designated as Technology of Foods. In 1951, the four-year Post-lnterscience course, B.Chem.Engg. course replaced the earlier B.Sc. (Tech) course in Chemical Engineering and the intake was increased from 15 to 20. In 1958, the number of seats for the B.Chem.Enng course were further increased to 60. The Departments of Chemistry and General Engineering were started in 1952. The first female student was awarded a Ph.D. (Tech) in 1957. A three-year Bachelors of Pharmacy (B.Pharm) course was launched in 1958, becoming the first course of its kind in the state of Maharashtra. In 1960, ICT celebrated its Silver Jubilee, and the occasion was graced by then Prime Minister of India, Jawaharlal Nehru. In 1984, a four-year B.Pharm course replaced the earlier three-year course. In 2001, four year B.Tech courses replaced all B.Sc. (Tech) courses.\n\n\n=== Autonomy ===\nThe university received partial autonomy from University of Mumbai in 1985 and was conferred the autonomous status on the UDCT in 1994, with concurren"
    }
  ],
  "collected_at": "2025-03-29T20:04:20.979310"
}