{
  "basic_info": {
    "id": "sergey_brin",
    "name": "Sergey Brin",
    "net_worth": "$89 billion",
    "source": "47",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Sergey_Brin",
    "summary": "Sergey Mikhailovich Brin (Russian: Сергей Михайлович Брин; born August 21, 1973) is an American computer scientist and businessman who co-founded Google with Larry Page. He was the president of Google's parent company, Alphabet Inc., until stepping down from the role on December 3, 2019. He and Page remain at Alphabet as co-founders, controlling shareholders and board members. As of March 2025, Brin is the 9th-richest person in the world, with an estimated net worth of $164 billion, according to the Bloomberg Billionaires Index and Forbes.\nBrin immigrated to the United States from the Soviet Union at the age of six. He earned his bachelor's degree at the University of Maryland, College Park, following in his father's and grandfather's  footsteps by studying mathematics as well as computer science. After graduation, in September 1993, he enrolled in Stanford University to acquire a PhD in computer science. There he met Page, with whom he built a web search engine. The program became popular at Stanford, and he discontinued his PhD studies to start Google in Susan Wojcicki's garage in Menlo Park."
  },
  "biography": {
    "error": "Error code: 404 - {'error': {'message': 'The model `gpt-4-0314` has been deprecated, learn more here: https://platform.openai.com/docs/deprecations', 'type': 'invalid_request_error', 'param': None, 'code': 'model_not_found'}}"
  },
  "business_philosophy": {
    "error": "Error code: 404 - {'error': {'message': 'The model `gpt-4-0314` has been deprecated, learn more here: https://platform.openai.com/docs/deprecations', 'type': 'invalid_request_error', 'param': None, 'code': 'model_not_found'}}"
  },
  "expertise_areas": [],
  "innovation_contributions": [],
  "leadership_style": {},
  "risk_management": {},
  "quotes": [
    {
      "text": "became intellectual soul-mates and close friends.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "the concept of inferring the importance of a research paper from its citations in other papers",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "The Anatomy of a Large-Scale Hypertextual Web Search Engine",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "We realized that we had a querying tool. It gave you a good overall ranking of pages and ordering of follow-up pages.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "Pretty soon, we had 10,000 searches a day. And we figured, maybe this is really real.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "Not since Gutenberg ... has any new invention empowered individuals, and transformed access to information, as profoundly as Google.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "cooked up their new engine for web searches, they began thinking about information that was at the time beyond the web,",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "for embodying the entrepreneurial spirit and lending momentum to the creation of new businesses...",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "cited for the invention that has fundamentally changed the way information is retrieved today.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "among the highest professional distinctions accorded to an engineer ... [and] honors those who have made outstanding contributions to engineering research, practice...",
      "source": "Wikipedia",
      "context": "From biographical content"
    }
  ],
  "related_articles": [
    {
      "title": "East Slavic naming customs",
      "url": "https://en.wikipedia.org/wiki/East_Slavic_naming_customs",
      "summary": "East Slavic naming customs are the traditional way of identifying a person's family name, given name, and patronymic name in East Slavic cultures in Russia and some countries formerly part of the Russian Empire and the Soviet Union.\nThey are used commonly in Russia, Ukraine, Belarus, Kazakhstan, Turkmenistan, Uzbekistan, and to a lesser extent in Kyrgyzstan, Tajikistan, Azerbaijan, Armenia, and Georgia. \n\n",
      "content": "East Slavic naming customs are the traditional way of identifying a person's family name, given name, and patronymic name in East Slavic cultures in Russia and some countries formerly part of the Russian Empire and the Soviet Union.\nThey are used commonly in Russia, Ukraine, Belarus, Kazakhstan, Turkmenistan, Uzbekistan, and to a lesser extent in Kyrgyzstan, Tajikistan, Azerbaijan, Armenia, and Georgia. \n\n\n== Given names ==\nEast Slavic parents select a given name for a newborn child. Most first names in East Slavic languages originate from two sources:\n\nEastern Orthodox Church tradition\nnative pre-Christian Slavic lexicons\nAlmost all first names are single. Doubled first names (as in, for example, French, like Jean-Luc) are very rare and are from foreign influence. Most doubled first names are written with a hyphen: Mariya-Tereza.\n\n\n=== Males ===\n\n\n=== Females ===\n\n\n=== Forms ===\nBeing highly synthetic languages, the East Slavic ones treat personal names as grammatical nouns and apply the same rules of inflection and derivation to them as for other nouns. So one can create many forms with different degrees of affection and familiarity by adding the corresponding suffixes to the auxiliary stem derived from the original name. The auxiliary stem may be identical to the word stem of the full name (the full name Жанна Zhanna can have the suffixes added directly to the stem Жанн- Zhann- like Жанночка Zhannochka), and most names have the auxiliary stem derived unproductively (the Russian name Михаил Mikhail has the auxiliary stem Миш- Mish-, which produces such name-forms as Миша Misha, Мишенька Mishenka, Мишуня Mishunya etc., not *Михаилушка Mikhailushka).\nUnlike English, in which the use of diminutive forms is optional even between close friends, in East Slavonic languages, such forms are obligatory in certain contexts because of the strong T–V distinction: the T-form of address usually requires the short form of the counterpart's name. Also, unlike other languages with prominent use of name suffixes, such as Japanese, the use of derived name forms is mostly limited to the T-addressing: there is no way to make the name more formal than the plain unsuffixed full form, and usually no suffixes can be added to the family name.\nMost commonly, Russian philologists distinguish the following forms of given names:\n\n\n==== Short forms ====\n\nThe \"short name\" (Russian: краткое имя kratkoye imya), historically also \"half-name\" (Russian: полуимя poluimya), is the simplest and most common name derivative. Bearing no suffix, it is produced suppletively and always has the declension noun ending for both males and females, thus making short forms of certain unisex names indistinguishable: for example, Sasha (Russian: Саша) is the short name for both the masculine name Aleksandr (Alexander) and the feminine form Aleksandra (Alexandra).\nSome names, such as Zhanna (Jeana) and Mark, have no short forms; others may have two (or more) different forms. In the latter case, one form is usually more informal than the other.\n\n\n==== Diminutive forms ====\n\nDiminutive forms are produced from the \"short name\" by means of various suffixes; for example, Михаил Mikhail (full) – Миша Misha (short) – Мишенька Mishenka (affectionate) – Мишка Mishka (colloquial). If no \"short name\" exists, then diminutive forms are produced from the full form of the respective first name; for example, Марина Marina (full) – Мариночка Marinochka (affectionate) – Маринка Marinka (colloquial). Unlike the full name, a diminutive name carries a particular emotional attitude and may be unacceptable in certain contexts. Depending on the nature of the attitude, diminutive name forms can be subdivided into three broad groups: affectionate, familiar, and slang.\n\n\n===== Affectionate diminutive =====\nTypically formed by suffixes -еньк- (-yenk-), -оньк- (-onk-), -ечк- (-yechk-), -ушк (-ushk), as illustrated by the examples below. It generally emphasises a tender, affectionate attitude and is roughly a"
    },
    {
      "title": "Patronymic",
      "url": "https://en.wikipedia.org/wiki/Patronymic",
      "summary": "A patronymic, or patronym, is a component of a personal name based on the given name of one's father, grandfather (more specifically an avonymic), or an earlier male ancestor. It is the male equivalent of a matronymic.\nPatronymics are used, by custom or official policy, in many countries worldwide, although elsewhere their use has been replaced by or transformed into patronymic surnames. Examples of such transformations include common English surnames such as Johnson (son of John).\n\n",
      "content": "A patronymic, or patronym, is a component of a personal name based on the given name of one's father, grandfather (more specifically an avonymic), or an earlier male ancestor. It is the male equivalent of a matronymic.\nPatronymics are used, by custom or official policy, in many countries worldwide, although elsewhere their use has been replaced by or transformed into patronymic surnames. Examples of such transformations include common English surnames such as Johnson (son of John).\n\n\n== Origins of terms ==\nThe usual noun and adjective in English is patronymic, but as a noun this exists in free variation alongside patronym. The first part of the word patronym comes from Greek πατήρ patēr 'father' (GEN πατρός patros whence the combining form πατρο- patro-); the second part comes from Greek ὄνυμα onyma, a variant form of ὄνομα onoma 'name'. In the form patronymic, this stands with the addition of the suffix -ικός (-ikos), which was originally used to form adjectives with the sense 'pertaining to' (thus 'pertaining to the father's name'). These forms are attested in Hellenistic Greek as πατρώνυμος (patrōnymos) and πατρωνυμικός (patrōnymikos). The form patronym, first attested in English in 1834, was borrowed into English from French patronyme, which had previously borrowed the word directly from Greek. Patronymic, first attested in English in 1612, has a more complex history. Both Greek words had entered Latin, and, from Latin, French. The English form patronymic was borrowed through the mutual influence of French and Latin on English.\n\n\n== History ==\n\nIn many areas around the world, patronyms predate the use of family names. Family names in many Celtic, Germanic, Iberian, Georgian, Armenian and Slavic languages originate from patronyms, e.g. Wilson (son of William), FitzGerald (son of Gerald), Powell (from \"ap Hywel\"), Fernández (son of Fernando), Rodríguez (son of Rodrigo), Andersson or Andersen (son of Anders, Scandinavian form of Andrew), Carlsen (son of Carl), Ilyin (of Ilya), Petrov (of Peter), Grigorovich (son of Grigory, Russian form of Gregory), Stefanović (son of Stefan, little Stefan), MacAllister (from \"mac Alistair\", meaning son of Alistair, anglicized Scottish form of Alexander) and O'Conor (from \"Ó Conchobhair\", meaning grandson/descendant of Conchobhar). Other cultures which formerly used patronyms have switched to the more widespread style of passing the father's last name to the children (and wife) as their own.\nIn Iceland, family names are unusual; Icelandic law favours the use of patronyms (and more recently, matronyms) over family names.\n\n\n== Historical and current use ==\n\n\n=== Africa ===\nTraditionally Muslim and non-Arabic speaking African people, such as Hausa and Fulani people, usually (with some exceptions) follow the Arab naming pattern. The word or phrase meaning \"son of\" is, however, omitted. As such, Mohamed son of Ibrahim son of Ahmed is \"Mohamed Ibrahim Ahmed\", and Mohamed Ibrahim Ahmed's son Ali is \"Ali Mohamed Ibrahim\".\n\n\n==== Ethiopia and Eritrea ====\n\nThe naming convention used in Eritrea and Ethiopia does not have family names and surnames. A person is referred to by a single name: this is always the person's given name. Ethiopians and Eritreans use a naming pattern very similar to the Arab naming pattern, but with one exception: no suffix or prefix. The full name of a person is usually two but officially registered with three names. The person's given name comes first, followed by their father's given name and (optionally, for official purposes) their grandfather's name last. For example, a person named Lemlem Mengesha Abraha has Lemlem as her given name, Mengesha (from her father's name) Abraha (grandfather's name). The grandfather's name is usually only added in official documents and not used in everyday life. The father's name is not considered a middle name but a last name, without it being a family name or surname. Women do not take their husband's last name. They continue to go independe"
    },
    {
      "title": "Moscow",
      "url": "https://en.wikipedia.org/wiki/Moscow",
      "summary": "Moscow is the capital and largest city of Russia, standing on the Moskva River in Central Russia. It has a population estimated at over 13 million residents within the city limits, over 19.1 million residents in the urban area, and over 21.5 million residents in its metropolitan area. The city covers an area of 2,511 square kilometers (970 sq mi), while the urban area covers 5,891 square kilometers (2,275 sq mi), and the metropolitan area covers over 26,000 square kilometers (10,000 sq mi). Moscow is among the world's largest cities, being the most populous city entirely in Europe, the largest urban and metropolitan area in Europe, and the largest city by land area on the European continent.\nFirst documented in 1147, Moscow became the capital of the Grand Principality of Moscow, which led the unification of the Russian lands in the 15th century. Following the proclamation of the Tsardom of Russia in 1547, Moscow remained the political and economic center for most of its history. During the reign of Peter the Great, the Russian capital was moved to the newly founded city of Saint Petersburg in 1712, decreasing Moscow's influence. Following the Russian Revolution and the establishment of the Russian SFSR, the capital was moved back to Moscow in 1918, where it later became the political center of the Soviet Union. In the aftermath of the dissolution of the Soviet Union, Moscow remained the capital city of the newly reconstituted Russian Federation.\nThe northernmost and coldest megacity in the world, Moscow is governed as a federal city, where it serves as the political, economic, cultural, and scientific center of Russia and Eastern Europe. As a global city, Moscow has one of the world's largest urban economies. The city is one of the fastest-growing tourist destinations and is one of Europe's most visited cities. Moscow has the second-highest number of billionaires of any city (tied with Hong Kong). The Moscow International Business Center is one of the largest financial centers in the world and features the majority of Europe's tallest skyscrapers. Moscow was the host city of the 1980 Summer Olympics and one of the host cities of the 2018 FIFA World Cup.\nThe city contains several UNESCO World Heritage Sites and is known for its display of Russian architecture, particularly in areas such as the Red Square and buildings such as the Saint Basil's Cathedral and the Moscow Kremlin, the latter of which is the seat of power of the Government of Russia. Moscow is home to Russian companies in different industries and is served by a comprehensive transit network, which includes four international airports, ten railway terminals, a tram system, a monorail system, and the Moscow Metro, which is the busiest metro system in Europe and one of the largest rapid transit systems in the world. The city has over 40 percent of its territory covered by greenery, making it one of the greenest cities in the world.\n\n",
      "content": "Moscow is the capital and largest city of Russia, standing on the Moskva River in Central Russia. It has a population estimated at over 13 million residents within the city limits, over 19.1 million residents in the urban area, and over 21.5 million residents in its metropolitan area. The city covers an area of 2,511 square kilometers (970 sq mi), while the urban area covers 5,891 square kilometers (2,275 sq mi), and the metropolitan area covers over 26,000 square kilometers (10,000 sq mi). Moscow is among the world's largest cities, being the most populous city entirely in Europe, the largest urban and metropolitan area in Europe, and the largest city by land area on the European continent.\nFirst documented in 1147, Moscow became the capital of the Grand Principality of Moscow, which led the unification of the Russian lands in the 15th century. Following the proclamation of the Tsardom of Russia in 1547, Moscow remained the political and economic center for most of its history. During the reign of Peter the Great, the Russian capital was moved to the newly founded city of Saint Petersburg in 1712, decreasing Moscow's influence. Following the Russian Revolution and the establishment of the Russian SFSR, the capital was moved back to Moscow in 1918, where it later became the political center of the Soviet Union. In the aftermath of the dissolution of the Soviet Union, Moscow remained the capital city of the newly reconstituted Russian Federation.\nThe northernmost and coldest megacity in the world, Moscow is governed as a federal city, where it serves as the political, economic, cultural, and scientific center of Russia and Eastern Europe. As a global city, Moscow has one of the world's largest urban economies. The city is one of the fastest-growing tourist destinations and is one of Europe's most visited cities. Moscow has the second-highest number of billionaires of any city (tied with Hong Kong). The Moscow International Business Center is one of the largest financial centers in the world and features the majority of Europe's tallest skyscrapers. Moscow was the host city of the 1980 Summer Olympics and one of the host cities of the 2018 FIFA World Cup.\nThe city contains several UNESCO World Heritage Sites and is known for its display of Russian architecture, particularly in areas such as the Red Square and buildings such as the Saint Basil's Cathedral and the Moscow Kremlin, the latter of which is the seat of power of the Government of Russia. Moscow is home to Russian companies in different industries and is served by a comprehensive transit network, which includes four international airports, ten railway terminals, a tram system, a monorail system, and the Moscow Metro, which is the busiest metro system in Europe and one of the largest rapid transit systems in the world. The city has over 40 percent of its territory covered by greenery, making it one of the greenest cities in the world.\n\n\n== Etymology ==\nThe city's name is thought to be derived from the Moskva River. Theories of the origin of the name of the river have been proposed.\nThe most linguistically well-grounded and widely accepted is from the Proto-Balto-Slavic root *mŭzg-/muzg- from the Proto-Indo-European *meu- \"wet\", so the name Moskva might signify a river at a wetland or marsh. Its cognates include Russian: музга, muzga \"pool, puddle\", Lithuanian: mazgoti and Latvian: mazgāt \"to wash\", Sanskrit: májjati \"to drown\", Latin: mergō \"to dip, immerse\". In many Slavic countries Moskov is a surname, most common in Russia, Bulgaria, Ukraine and North Macedonia. Additionally, there are similarly named places in Poland like Mozgawa. According to a Finno-Ugric hypothesis, the Merya and Muroma people, who were among the pre-Slavic tribes which inhabited the area, called the river Mustajoki \"Black river\", and the name of the river derives from this term. Other theories, having little or no scientific basis, are rejected by linguists.\nThe Old Russian form of the name is rec"
    },
    {
      "title": "Soviet Union",
      "url": "https://en.wikipedia.org/wiki/USSR",
      "summary": "The Union of Soviet Socialist Republics (USSR), commonly known as the Soviet Union, was a transcontinental country that spanned much of Eurasia from 1922 to 1991. During its existence, it was the largest country by area, extending across eleven time zones and sharing borders with twelve countries, and the third-most populous country. An overall successor to the Russian Empire, it was nominally organized as a federal union of national republics, the largest and most populous of which was the Russian SFSR. In practice, its government and economy were highly centralized. As a one-party state governed by the Communist Party of the Soviet Union (CPSU), it was a flagship communist state. Its capital and largest city was Moscow.\nThe Soviet Union's roots lay in the October Revolution of 1917. The new government, led by Vladimir Lenin, established the Russian SFSR, the world's first constitutionally socialist state. The revolution was not accepted by all within the Russian Republic, resulting in the Russian Civil War. The Russian SFSR and its subordinate republics were merged into the Soviet Union in 1922. Following Lenin's death in 1924, Joseph Stalin came to power, inaugurating rapid industrialization and forced collectivization that led to significant economic growth but contributed to a famine between 1930 and 1933 that killed millions. The Soviet forced labour camp system of the Gulag was expanded. During the late 1930s, Stalin's government conducted the Great Purge to remove opponents, resulting in mass death, imprisonment, and deportation. In 1939, the Soviet Union and Nazi Germany signed a nonaggression pact, but in 1941, Germany invaded the Soviet Union in the largest land invasion in history, opening the Eastern Front of World War II. The Soviets played a decisive role in defeating the Axis powers, suffering an estimated 27 million casualties, which accounted for most Allied losses. In the aftermath of the war, the Soviet Union consolidated the territory occupied by the Red Army, forming satellite states, and undertook rapid economic development which cemented its status as a superpower.\nGeopolitical tensions with the United States led to the Cold War. The American-led Western Bloc coalesced into NATO in 1949, prompting the Soviet Union to form its own military alliance, the Warsaw Pact, in 1955. Neither side engaged in direct military confrontation, and instead fought on an ideological basis and through proxy wars. In 1953, following Stalin's death, the Soviet Union undertook a campaign of de-Stalinization under Nikita Khrushchev, which saw reversals and rejections of Stalinist policies. This campaign caused tensions with Communist China. During the 1950s, the Soviet Union expanded its efforts in space exploration and took a lead in the Space Race with the first artificial satellite, the first human spaceflight, the first space station, and the first probe to land on another planet. In 1985, the last Soviet leader, Mikhail Gorbachev, sought to reform the country through his policies of glasnost and perestroika. In 1989, various countries of the Warsaw Pact overthrew their Soviet-backed regimes, and nationalist and separatist movements erupted across the Soviet Union. In 1991, amid efforts to preserve the country as a renewed federation, an attempted coup against Gorbachev by hardline communists prompted the largest republics—Ukraine, Russia, and Belarus—to secede. On 26 December, Gorbachev officially recognized the dissolution of the Soviet Union. Boris Yeltsin, the leader of the Russian SFSR, oversaw its reconstitution into the Russian Federation, which became the Soviet Union's successor state; all other republics emerged as fully independent post-Soviet states.\nDuring its existence, the Soviet Union produced many significant social and technological achievements and innovations. It had the world's second-largest economy and largest standing military. An NPT-designated state, it wielded the largest arsenal of nuclear weapons in the world. As an Allied nation, it was a founding member of the United Nations as well as one of the five permanent members of the United Nations Security Council. Before its dissolution, the Soviet Union was one of the world's two superpowers through its hegemony in Eastern Europe, global diplomatic and ideological influence (particularly in the Global South), military and economic strengths, and scientific accomplishments.",
      "content": "The Union of Soviet Socialist Republics (USSR), commonly known as the Soviet Union, was a transcontinental country that spanned much of Eurasia from 1922 to 1991. During its existence, it was the largest country by area, extending across eleven time zones and sharing borders with twelve countries, and the third-most populous country. An overall successor to the Russian Empire, it was nominally organized as a federal union of national republics, the largest and most populous of which was the Russian SFSR. In practice, its government and economy were highly centralized. As a one-party state governed by the Communist Party of the Soviet Union (CPSU), it was a flagship communist state. Its capital and largest city was Moscow.\nThe Soviet Union's roots lay in the October Revolution of 1917. The new government, led by Vladimir Lenin, established the Russian SFSR, the world's first constitutionally socialist state. The revolution was not accepted by all within the Russian Republic, resulting in the Russian Civil War. The Russian SFSR and its subordinate republics were merged into the Soviet Union in 1922. Following Lenin's death in 1924, Joseph Stalin came to power, inaugurating rapid industrialization and forced collectivization that led to significant economic growth but contributed to a famine between 1930 and 1933 that killed millions. The Soviet forced labour camp system of the Gulag was expanded. During the late 1930s, Stalin's government conducted the Great Purge to remove opponents, resulting in mass death, imprisonment, and deportation. In 1939, the Soviet Union and Nazi Germany signed a nonaggression pact, but in 1941, Germany invaded the Soviet Union in the largest land invasion in history, opening the Eastern Front of World War II. The Soviets played a decisive role in defeating the Axis powers, suffering an estimated 27 million casualties, which accounted for most Allied losses. In the aftermath of the war, the Soviet Union consolidated the territory occupied by the Red Army, forming satellite states, and undertook rapid economic development which cemented its status as a superpower.\nGeopolitical tensions with the United States led to the Cold War. The American-led Western Bloc coalesced into NATO in 1949, prompting the Soviet Union to form its own military alliance, the Warsaw Pact, in 1955. Neither side engaged in direct military confrontation, and instead fought on an ideological basis and through proxy wars. In 1953, following Stalin's death, the Soviet Union undertook a campaign of de-Stalinization under Nikita Khrushchev, which saw reversals and rejections of Stalinist policies. This campaign caused tensions with Communist China. During the 1950s, the Soviet Union expanded its efforts in space exploration and took a lead in the Space Race with the first artificial satellite, the first human spaceflight, the first space station, and the first probe to land on another planet. In 1985, the last Soviet leader, Mikhail Gorbachev, sought to reform the country through his policies of glasnost and perestroika. In 1989, various countries of the Warsaw Pact overthrew their Soviet-backed regimes, and nationalist and separatist movements erupted across the Soviet Union. In 1991, amid efforts to preserve the country as a renewed federation, an attempted coup against Gorbachev by hardline communists prompted the largest republics—Ukraine, Russia, and Belarus—to secede. On 26 December, Gorbachev officially recognized the dissolution of the Soviet Union. Boris Yeltsin, the leader of the Russian SFSR, oversaw its reconstitution into the Russian Federation, which became the Soviet Union's successor state; all other republics emerged as fully independent post-Soviet states.\nDuring its existence, the Soviet Union produced many significant social and technological achievements and innovations. It had the world's second-largest economy and largest standing military. An NPT-designated state, it wielded the largest arsenal of nuclear weapo"
    }
  ],
  "collected_at": "2025-03-29T20:02:30.956546"
}