{
  "basic_info": {
    "id": "warren_buffett",
    "name": "Warren Buffett",
    "net_worth": "$106 billion",
    "source": "92",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Warren_Buffett",
    "summary": "Warren Edward Buffett ( BUF-it; born August 30, 1930) is an American investor and philanthropist who currently serves as the chairman and CEO of Berkshire Hathaway. As a result of his investment success, Buffett is one of the best-known investors in the world. According to Forbes, as of 17 February 2025, Buffett's estimated net worth stood at US$149.6 billion, making him the seventh richest individual in the world.\nBuffett was born in Omaha, Nebraska. The son of US congressman and businessman Howard Buffett, he developed an interest in business and investing during his youth. He entered the Wharton School of the University of Pennsylvania in 1947 before graduating from the University of Nebraska at 20. He went on to graduate from Columbia Business School, where he molded his investment philosophy around the concept of value investing pioneered by Benjamin Graham. He attended New York Institute of Finance to focus on his economics background and soon pursued a business career.\nHe later began various business ventures and investment partnerships, including one with Graham. He created Buffett Partnership Ltd. in 1956 and his investment firm eventually acquired a textile manufacturing firm, Berkshire Hathaway, assuming its name to create a diversified holding company. Buffett emerged as the company's chairman and majority shareholder in 1970. In 1978, fellow investor and long-time business associate Charlie Munger joined Buffett as vice-chairman.\nSince 1970, Buffett has presided as the chairman and largest shareholder of Berkshire Hathaway, one of America's foremost holding companies and world's leading corporate conglomerates. He has been referred to as the \"Oracle\" or \"Sage\" of Omaha by global media as a result of having accumulated a massive fortune derived from his business and investment success. He is noted for his adherence to the principles of value investing, and his frugality despite his wealth. Buffett has pledged to give away 99 percent of his fortune to philanthropic causes, primarily via the Bill & Melinda Gates Foundation. He founded the Giving Pledge in 2010 with Bill Gates, whereby billionaires pledge to give away at least half of their fortunes."
  },
  "biography": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "business_philosophy": {
    "error": "Error code: 429 - {'error': {'message': 'You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: https://platform.openai.com/docs/guides/error-codes/api-errors.', 'type': 'insufficient_quota', 'param': None, 'code': 'insufficient_quota'}}"
  },
  "expertise_areas": [],
  "innovation_contributions": [],
  "leadership_style": {},
  "risk_management": {},
  "quotes": [
    {
      "text": "underwriting standards proved to be inadequate",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "fallen off a cliff ... Not only has the economy slowed down a lot, but people have really changed their habits like I haven't seen",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "I don't know of any large company that really has been as specific on what they intend to do and how they intend to do it as IBM",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "$80 billion or $90 billion a year probably",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "I don’t think there’s the slightest chance that Warren Buffett is doing something that is deeply evil to make money for himself.",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "when trillions of dollars are managed by Wall Streeters charging high fees, it will usually be the managers who reap outsized profits, not the clients",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "I have not emotionally or legally adopted you as a grandchild, nor have the rest of my family adopted you as a niece or a cousin",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "It was getting kind of desperate around here",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "great—as if I were in my normal excellent health—and my energy level is 100 percent",
      "source": "Wikipedia",
      "context": "From biographical content"
    },
    {
      "text": "it's a great day for me",
      "source": "Wikipedia",
      "context": "From biographical content"
    }
  ],
  "related_articles": [
    {
      "title": "Omaha, Nebraska",
      "url": "https://en.wikipedia.org/wiki/Omaha,_Nebraska",
      "summary": "Omaha ( OH-mə-hah) is the most populous city in the U.S. state of Nebraska and the county seat of Douglas County. It is located in the Midwestern United States along the Missouri River, about 10 mi (15 km) north of the mouth of the Platte River. The nation's 41st-most populous city, Omaha had a population of 486,051 as of the 2020 United States census. It is the anchor of the eight-county Omaha–Council Bluffs metropolitan area, which extends into Iowa and is the 55th-largest metro area in the United States, with a population of 1,001,010. Furthermore, the greater Omaha–Council Bluffs–Fremont combined statistical area had 1,038,894 residents in 2024.\nOmaha's pioneer period began in 1854, when the city was founded by speculators from neighboring Council Bluffs, Iowa. The city was founded along the Missouri River, and a crossing called Lone Tree Ferry earned the city its nickname, the \"Gateway to the West\". Omaha introduced this new West to the world in 1898, when it played host to the World's Fair, dubbed the Trans-Mississippi Exposition. During the 19th century, Omaha's central location in the United States spurred the city to become an important national transportation hub. Throughout the rest of the 19th century, the transportation and jobbing sectors were important in the city, along with its railroads and breweries. In the 20th century, the Omaha Stockyards, once the world's largest, and its meatpacking plants gained international prominence.\nOmaha is the home to the headquarters of four Fortune 500 companies: Berkshire Hathaway, Kiewit Corporation, Mutual of Omaha, and Union Pacific Corporation. Other companies headquartered in the city include First National Bank of Omaha, Gallup, Inc., Green Plains, Intrado, Valmont Industries, Werner Enterprises, and three of the nation's ten largest architecture and engineering firms (DLR Group, HDR, Inc., and Leo A Daly). Notable cultural institutions include the Henry Doorly Zoo and Aquarium, Old Market, Durham Museum, Lauritzen Gardens, and annual College World Series. Modern Omaha inventions include the Reuben sandwich; cake mix, developed by Duncan Hines; center-pivot irrigation; Raisin Bran; the first ski lift in the U.S.; the Top 40 radio format as first used in the U.S. at Omaha's KOWH Radio; and the TV dinner.",
      "content": "Omaha ( OH-mə-hah) is the most populous city in the U.S. state of Nebraska and the county seat of Douglas County. It is located in the Midwestern United States along the Missouri River, about 10 mi (15 km) north of the mouth of the Platte River. The nation's 41st-most populous city, Omaha had a population of 486,051 as of the 2020 United States census. It is the anchor of the eight-county Omaha–Council Bluffs metropolitan area, which extends into Iowa and is the 55th-largest metro area in the United States, with a population of 1,001,010. Furthermore, the greater Omaha–Council Bluffs–Fremont combined statistical area had 1,038,894 residents in 2024.\nOmaha's pioneer period began in 1854, when the city was founded by speculators from neighboring Council Bluffs, Iowa. The city was founded along the Missouri River, and a crossing called Lone Tree Ferry earned the city its nickname, the \"Gateway to the West\". Omaha introduced this new West to the world in 1898, when it played host to the World's Fair, dubbed the Trans-Mississippi Exposition. During the 19th century, Omaha's central location in the United States spurred the city to become an important national transportation hub. Throughout the rest of the 19th century, the transportation and jobbing sectors were important in the city, along with its railroads and breweries. In the 20th century, the Omaha Stockyards, once the world's largest, and its meatpacking plants gained international prominence.\nOmaha is the home to the headquarters of four Fortune 500 companies: Berkshire Hathaway, Kiewit Corporation, Mutual of Omaha, and Union Pacific Corporation. Other companies headquartered in the city include First National Bank of Omaha, Gallup, Inc., Green Plains, Intrado, Valmont Industries, Werner Enterprises, and three of the nation's ten largest architecture and engineering firms (DLR Group, HDR, Inc., and Leo A Daly). Notable cultural institutions include the Henry Doorly Zoo and Aquarium, Old Market, Durham Museum, Lauritzen Gardens, and annual College World Series. Modern Omaha inventions include the Reuben sandwich; cake mix, developed by Duncan Hines; center-pivot irrigation; Raisin Bran; the first ski lift in the U.S.; the Top 40 radio format as first used in the U.S. at Omaha's KOWH Radio; and the TV dinner.\n\n\n== History ==\n\nVarious Native American tribes had lived in the land that became Omaha since the 17th century, including the Omaha and Ponca, Dhegihan-Siouan language people who had originated in the lower Ohio River valley and migrated west by the early 17th century; Pawnee, Otoe, Missouria, and Iowa. The word Omaha (actually Umoⁿhoⁿ or Umaⁿhaⁿ) in the Omaha language means \"Upstream People\" or \"Against the Current\".\nIn 1804 the Lewis and Clark Expedition passed the riverbanks where the city of Omaha would be built. Between July 30 and August 3, 1804, members of the expedition, including Meriwether Lewis and William Clark, met with Oto and Missouria tribal leaders at the Council Bluff at a point about 20 mi (32 km) north of present-day Omaha. Immediately south of that area, Americans built several fur trading outposts in succeeding years, including Fort Lisa in 1812; Fort Atkinson in 1819; Cabanné's Trading Post, built in 1822, and Fontenelle's Post in 1823, in what became Bellevue. There was fierce competition among fur traders until John Jacob Astor created the monopoly of the American Fur Company. The Mormons built a town called Cutler's Park in the area in 1846. While it was temporary, the settlement provided the basis for further development.\nThrough 26 separate treaties with the United States federal government, Native American tribes in Nebraska gradually ceded the lands that now make up the state. The treaty and cession involving the Omaha area occurred in 1854 when the Omaha Tribe ceded most of east-central Nebraska. Logan Fontenelle, an interpreter for the Omaha and signatory to the 1854 treaty, played an essential role in those proceedings.\n\n\n=== Pioneer Omah"
    },
    {
      "title": "University of Pennsylvania",
      "url": "https://en.wikipedia.org/wiki/University_of_Pennsylvania",
      "summary": "The University of Pennsylvania (Penn or UPenn) is a private Ivy League research university in Philadelphia, Pennsylvania, United States. It is one of nine colonial colleges and was chartered prior to the U.S. Declaration of Independence when Benjamin Franklin, the university's founder and first president, advocated for an educational institution that trained leaders in academia, commerce, and public service. \nThe university has four undergraduate schools and 12 graduate and professional schools. Schools enrolling undergraduates include the College of Arts and Sciences, the School of Engineering and Applied Science, the Wharton School, and the School of Nursing. Among its graduate schools are its law school, whose first professor James Wilson participated in writing the first draft of the U.S. Constitution, and its medical school, which was the first medical school established in North America.\nIn 2023, Penn ranked third among U.S. universities in research expenditures, according to the National Science Foundation. Its endowment is $22.3 billion, making it the sixth-wealthiest private academic institution in the nation as of 2024. The University of Pennsylvania's main campus is located in the University City neighborhood of West Philadelphia, and is centered around College Hall. Notable campus landmarks include Houston Hall, the first modern student union, and Franklin Field, the nation's first dual-level college football stadium and the nation's longest-standing NCAA Division I college football stadium in continuous operation. The university's athletics program, the Penn Quakers, fields varsity teams in 33 sports as a member of NCAA Division I's Ivy League conference.\nPenn alumni, trustees, and faculty include eight Founding Fathers of the United States who signed the Declaration of Independence, seven who signed the United States Constitution, 24 members of the Continental Congress, three Presidents of the United States (including the 9th, 45th, 46th and 47th Presidents), 38 Nobel laureates, nine foreign heads of state, three United States Supreme Court justices, at least four Supreme Court justices of foreign nations, 32 U.S. senators, 163 members of the U.S. House of Representatives, 19 U.S. Cabinet Secretaries, 46 governors, 28 State Supreme Court justices, 36 living undergraduate billionaires (the largest number of any U.S. college or university), and five Medal of Honor recipients.",
      "content": "The University of Pennsylvania (Penn or UPenn) is a private Ivy League research university in Philadelphia, Pennsylvania, United States. It is one of nine colonial colleges and was chartered prior to the U.S. Declaration of Independence when Benjamin Franklin, the university's founder and first president, advocated for an educational institution that trained leaders in academia, commerce, and public service. \nThe university has four undergraduate schools and 12 graduate and professional schools. Schools enrolling undergraduates include the College of Arts and Sciences, the School of Engineering and Applied Science, the Wharton School, and the School of Nursing. Among its graduate schools are its law school, whose first professor James Wilson participated in writing the first draft of the U.S. Constitution, and its medical school, which was the first medical school established in North America.\nIn 2023, Penn ranked third among U.S. universities in research expenditures, according to the National Science Foundation. Its endowment is $22.3 billion, making it the sixth-wealthiest private academic institution in the nation as of 2024. The University of Pennsylvania's main campus is located in the University City neighborhood of West Philadelphia, and is centered around College Hall. Notable campus landmarks include Houston Hall, the first modern student union, and Franklin Field, the nation's first dual-level college football stadium and the nation's longest-standing NCAA Division I college football stadium in continuous operation. The university's athletics program, the Penn Quakers, fields varsity teams in 33 sports as a member of NCAA Division I's Ivy League conference.\nPenn alumni, trustees, and faculty include eight Founding Fathers of the United States who signed the Declaration of Independence, seven who signed the United States Constitution, 24 members of the Continental Congress, three Presidents of the United States (including the 9th, 45th, 46th and 47th Presidents), 38 Nobel laureates, nine foreign heads of state, three United States Supreme Court justices, at least four Supreme Court justices of foreign nations, 32 U.S. senators, 163 members of the U.S. House of Representatives, 19 U.S. Cabinet Secretaries, 46 governors, 28 State Supreme Court justices, 36 living undergraduate billionaires (the largest number of any U.S. college or university), and five Medal of Honor recipients.\n\n\n== History ==\n\nIn 1740, a group of Philadelphians organized to erect a great preaching hall for George Whitefield, a traveling Anglican evangelist, which was designed and constructed by Edmund Woolley. It was the largest building in Philadelphia at the time, and thousands of people attended it to hear Whitefield preach.: 26 \nIn the fall of 1749, Benjamin Franklin, a Founding Father and polymath in Philadelphia, circulated a pamphlet, \"Proposals Relating to the Education of Youth in Pensilvania,\" his vision for what he called a \"Public Academy of Philadelphia\".\nOn June 16, 1755, the College of Philadelphia was chartered, paving the way for the addition of undergraduate instruction. \nPenn identifies as the fourth-oldest institution of higher education in the United States, though this representation is challenged by Princeton and Columbia since the College of Philadelphia was not chartered or commence classes until 1755 and the first board of trustees was not convened until 1749, arguably making it the sixth or fifth-oldest.\n\n\n== Campus ==\n\nMuch of the current architecture on Penn's campus was designed by the Philadelphia-based architecture firm Cope and Stewardson, whose owners were Philadelphia born and raised architects and Penn professors who also designed Princeton University and a large part of Washington University in St. Louis. They were known for having combined the Gothic architecture of the University of Oxford and University of Cambridge with the local landscape to establish the Collegiate Gothic style.\nPenn's main artery at center"
    },
    {
      "title": "Bachelor of Science",
      "url": "https://en.wikipedia.org/wiki/Bachelor_of_Science",
      "summary": "A Bachelor of Science (BS, BSc, B.S., B.Sc., SB, or ScB; from the Latin scientiae baccalaureus) is a bachelor's degree that is awarded for programs that generally last three to five years.\nThe first university to admit a student to the degree of Bachelor of Science was the University of London in 1860. In the United States, the Lawrence Scientific School first conferred the degree in 1851, followed by the University of Michigan in 1855. Nathaniel Shaler, who was Harvard's Dean of Sciences, wrote in a private letter that \"the degree of Bachelor of Science came to be introduced into our system through the influence of Louis Agassiz, who had much to do in shaping the plans of this School.\": 48 \nWhether Bachelor of Science or Bachelor of Arts degrees are awarded in particular subjects varies between universities. For example, an economics student may graduate as a Bachelor of Arts in one university but as a Bachelor of Science in another, and occasionally, both options are offered. Some universities follow the Oxford and Cambridge tradition that even graduates in mathematics and the sciences become Bachelors of Arts, while other institutions offer only the Bachelor of Science degree, even in non-science fields.\nAt universities that offer both Bachelor of Arts and Bachelor of Science degrees in the same discipline, the Bachelor of Science degree is usually more focused on that particular discipline and is targeted toward students intending to pursue graduate school or a profession in that discipline.\n\n",
      "content": "A Bachelor of Science (BS, BSc, B.S., B.Sc., SB, or ScB; from the Latin scientiae baccalaureus) is a bachelor's degree that is awarded for programs that generally last three to five years.\nThe first university to admit a student to the degree of Bachelor of Science was the University of London in 1860. In the United States, the Lawrence Scientific School first conferred the degree in 1851, followed by the University of Michigan in 1855. Nathaniel Shaler, who was Harvard's Dean of Sciences, wrote in a private letter that \"the degree of Bachelor of Science came to be introduced into our system through the influence of Louis Agassiz, who had much to do in shaping the plans of this School.\": 48 \nWhether Bachelor of Science or Bachelor of Arts degrees are awarded in particular subjects varies between universities. For example, an economics student may graduate as a Bachelor of Arts in one university but as a Bachelor of Science in another, and occasionally, both options are offered. Some universities follow the Oxford and Cambridge tradition that even graduates in mathematics and the sciences become Bachelors of Arts, while other institutions offer only the Bachelor of Science degree, even in non-science fields.\nAt universities that offer both Bachelor of Arts and Bachelor of Science degrees in the same discipline, the Bachelor of Science degree is usually more focused on that particular discipline and is targeted toward students intending to pursue graduate school or a profession in that discipline.\n\n\n== International differences ==\n\nIn some institutions, there are historical and traditional reasons that govern the granting of BS or BA degrees regardless of the disciplines offered. Georgetown University's School of Foreign Service awards the Bachelor of Science in Foreign Service (BSFS) degrees to all of its undergraduates, although many students major in humanities-oriented fields such as international history or culture and politics. University of Pennsylvania's Wharton School awards the BS in Economics to all of its undergraduates, regardless if the candidates major in economics or not. The London School of Economics offers BSc degrees in practically all subject areas, even those normally associated with the arts and humanities.  Northwestern University's School of Communication grants the Bachelor of Science in Journalism degrees in all of its programs of study, including theater, dance, and radio/television/film. Meanwhile, the Oxbridge universities almost exclusively award the BA as a first degree.\nThe decision to grant a BS or BA degree at some institutions also depends on the constituent colleges, even when the candidate pursues the same or similar subjects. For instance, Cornell University offers a BS degree in computer science from its College of Engineering and a BA degree in computer science from its College of Arts and Sciences. Likewise, for candidates majoring in computer science, Columbia University offers BS degrees for those enrolled in the School of Engineering and Applied Science but awards BA degrees for graduates of Columbia College. At Harvard University, the same undergraduate degree in computer science can be an A.B. if taken at Harvard College or Harvard John A. Paulson School of Engineering and Applied Sciences, and an A.L.B. at Harvard Extension School.\n\n\n=== Argentina ===\nIn Argentina most university degrees are given as a license in a discipline. They are specific to a field and awarded to students upon completion of a course of study which lasts at least four and usually five years. \nIn most cases, at the end of a course and as a mandatory condition for its completion (and ultimately, to obtain a degree), students are compelled to produce an original research project related to their field. This project is usually referred to as a thesis (although the term actually corresponds to post-graduate studies).\n\n\n=== Australia, New Zealand and South Africa ===\nIn Australia, the BSc is generally a three to fo"
    },
    {
      "title": "Columbia University",
      "url": "https://en.wikipedia.org/wiki/Columbia_University",
      "summary": "Columbia University, officially Columbia University in the City of New York, is a private Ivy League research university in New York City. Established in 1754 as King's College on the grounds of Trinity Church in Manhattan, it is the oldest institution of higher education in New York and the fifth-oldest in the United States.\nColumbia was established as a colonial college by royal charter under George II of Great Britain. It was renamed Columbia College in 1784 following the American Revolution, and in 1787 was placed under a private board of trustees headed by former students Alexander Hamilton and John Jay. In 1896, the campus was moved to its current location in Morningside Heights and renamed Columbia University.\nColumbia is organized into twenty schools, including four undergraduate schools and 16 graduate schools. The university's research efforts include the Lamont–Doherty Earth Observatory, the Goddard Institute for Space Studies, and accelerator laboratories with Big Tech firms such as Amazon and IBM. Columbia is a founding member of the Association of American Universities and was the first school in the United States to grant the MD degree. The university also administers and annually awards the Pulitzer Prize.\nColumbia scientists and scholars have played a pivotal role in scientific breakthroughs including brain–computer interface; the laser and maser; nuclear magnetic resonance; the first nuclear pile; the first nuclear fission reaction in the Americas; the first evidence for plate tectonics and continental drift; and much of the initial research and planning for the Manhattan Project during World War II.\nAs of December 2021, its alumni, faculty, and staff have included 7 of the Founding Fathers of the United States of America; 4 U.S. presidents; 34 foreign heads of state or government; 2 secretaries-general of the United Nations; 10 justices of the United States Supreme Court; 103 Nobel laureates; 125 National Academy of Sciences members; 53 living billionaires; 23 Olympic medalists; 33 Academy Award winners; and 125 Pulitzer Prize  recipients.",
      "content": "Columbia University, officially Columbia University in the City of New York, is a private Ivy League research university in New York City. Established in 1754 as King's College on the grounds of Trinity Church in Manhattan, it is the oldest institution of higher education in New York and the fifth-oldest in the United States.\nColumbia was established as a colonial college by royal charter under George II of Great Britain. It was renamed Columbia College in 1784 following the American Revolution, and in 1787 was placed under a private board of trustees headed by former students Alexander Hamilton and John Jay. In 1896, the campus was moved to its current location in Morningside Heights and renamed Columbia University.\nColumbia is organized into twenty schools, including four undergraduate schools and 16 graduate schools. The university's research efforts include the Lamont–Doherty Earth Observatory, the Goddard Institute for Space Studies, and accelerator laboratories with Big Tech firms such as Amazon and IBM. Columbia is a founding member of the Association of American Universities and was the first school in the United States to grant the MD degree. The university also administers and annually awards the Pulitzer Prize.\nColumbia scientists and scholars have played a pivotal role in scientific breakthroughs including brain–computer interface; the laser and maser; nuclear magnetic resonance; the first nuclear pile; the first nuclear fission reaction in the Americas; the first evidence for plate tectonics and continental drift; and much of the initial research and planning for the Manhattan Project during World War II.\nAs of December 2021, its alumni, faculty, and staff have included 7 of the Founding Fathers of the United States of America; 4 U.S. presidents; 34 foreign heads of state or government; 2 secretaries-general of the United Nations; 10 justices of the United States Supreme Court; 103 Nobel laureates; 125 National Academy of Sciences members; 53 living billionaires; 23 Olympic medalists; 33 Academy Award winners; and 125 Pulitzer Prize  recipients.\n\n\n== History ==\n\n\n=== 18th century ===\n\nDiscussions regarding the founding of a college in the Province of New York began as early as 1704.\nClasses were initially held in July 1754 and were presided over by the college's first president, Samuel Johnson who was an Anglican Priest.: 8–10 : 3  The college was officially founded on October 31, 1754, as King's College by royal charter of George II, making it the oldest institution of higher learning in the State of New York and the fifth oldest in the United States.\nIn 1763, Johnson was succeeded in the presidency by Myles Cooper, a graduate of The Queen's College, Oxford, and an ardent Tory. In the charged political climate of the American Revolution, his chief opponent in discussions at the college was an undergraduate of the class of 1777, Alexander Hamilton.: 3  The Irish anatomist, Samuel Clossy, was appointed professor of natural philosophy in October 1765 and later the college's first professor of anatomy in 1767. \n\nThe American Revolutionary War broke out in 1776, and was catastrophic for the operation of King's College, which suspended instruction for eight years beginning in 1776 with the arrival of the Continental Army. The suspension continued through the military occupation of New York City by British troops until their departure in 1783. The college's library was looted and its sole building requisitioned for use as a military hospital first by American and then British forces.\n\nThe legislature agreed to assist the college, and on May 1, 1784, it passed \"an Act for granting certain privileges to the College heretofore called King's College\". The Act created a board of regents to oversee the resuscitation of King's College, and, in an effort to demonstrate its support for the new Republic, the legislature stipulated that \"the College within the City of New York heretofore called King's College be forever hereafter "
    }
  ],
  "collected_at": "2025-03-29T20:03:56.957497"
}